import type { Language, LevelScoring } from "../types/types"; // Import the interfaces

// =============================================================================
// I. โครงสร้างบทเรียน (Languages Data Structure)
// =============================================================================

/**
 * @constant languages
 * @description
 * อาร์เรย์หลักที่เก็บข้อมูลบทเรียนทั้งหมด มีโครงสร้างแบบลำดับชั้น (Hierarchical) ดังนี้
 * - Language[]: อาร์เรย์ของภาษา (เช่น ภาษาไทย, English)
 * - Unit[]: ในแต่ละภาษา จะมีหน่วยการเรียน (เช่น หน่วยที่ 1: พิมพ์แป้นเหย้า)
 * - Session[]: ในแต่ละหน่วย จะมีชุดแบบฝึกหัด (เช่น แบบฝึกหัดที่ 1.1)
 * - Level[]: ในแต่ละชุด จะมีด่านย่อยๆ ให้ฝึกพิมพ์
 * - id: รหัสเฉพาะสำหรับด่าน (Unique Identifier)
 * - name: ชื่อของด่านที่แสดงผลให้ผู้ใช้เห็น
 * - text: ข้อความที่ใช้ในการฝึกพิมพ์สำหรับด่านนั้นๆ
 * - timeLimit: (Optional) เวลากำหนดสำหรับด่าน (วินาที) เช่น 60, 120 หรือ null ถ้าไม่จำกัด
 */

export const languages: Language[] = [
  {
    id: "thai",
    name: "ภาษาไทย",
    units: [
      {
        id: "thai-unit-1",
        name: "หน่วยที่ 1: การพิมพ์แป้นเหย้า ฟ ห ก ด ่ า ส ว",
        sessions: [
          {
            id: "thai-session-1-1",
            name: "แบบฝึกหัดที่ 1.1: การพิมพ์แป้นเหย้า ฟ ห ก ด ่ า ส ว",
            levels: [
              {
                id: "thai-practice-1-1-1",
                name: "แบบฝึกย่อยที่ 1.1.1 ดดด",
                text: "ดดด ดดด ดดด ดดด ดดด ดดด ดดด ดดด ดดด ดดด",
              },
              {
                id: "thai-practice-1-1-2",
                name: "แบบฝึกย่อยที่ 1.1.2 ด่ด่ด่",
                text: "ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่",
              },
              {
                id: "thai-practice-1-1-3",
                name: "แบบฝึกย่อยที่ 1.1.3 กกก",
                text: "กกก กกก กกก กกก กกก กกก กกก กกก กกก กกก",
              },
              {
                id: "thai-practice-1-1-4",
                name: "แบบฝึกย่อยที่ 1.1.4 กากา",
                text: "กากา กากา กากา กากา กากา กากา กากา กากา กากา กากา",
              },
              {
                id: "thai-practice-1-1-5",
                name: "แบบฝึกย่อยที่ 1.1.5 หหห",
                text: "หหห หหห หหห หหห หหห หหห หหห หหห หหห หหห",
              },
              {
                id: "thai-practice-1-1-6",
                name: "แบบฝึกย่อยที่ 1.1.6 สสส",
                text: "สสส สสส สสส สสส สสส สสส สสส สสส สสส สสส",
              },
              {
                id: "thai-practice-1-1-7",
                name: "แบบฝึกย่อยที่ 1.1.7 ฟฟฟ",
                text: "ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ",
              },
              {
                id: "thai-practice-1-1-8",
                name: "แบบฝึกย่อยที่ 1.1.8 ววว",
                text: "ววว ววว ววว ววว ววว ววว ววว ววว ววว ววว",
              },
            ],
          },
          {
            id: "thai-session-1-2",
            name: "แบบฝึกหัดที่ 1.2: การพิมพ์แป้นเหย้า ฟ ห ก ด ่ า ส ว",
            levels: [
              {
                id: "thai-practice-1-2-1",
                name: "แบบฝึกย่อยที่ 1.2.1 ดดด ด่ด่ด่ กกก กากา",
                text: "ดดด ดดด ดดด ดดด ดดด ดดด ดดด ดดด ดดด ดดด ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ ด่ด่ด่ กกก กกก กกก กกก กกก กกก กกก กกก กกก กกก กากา กากา กากา กากา กากา กากา กากา กากา กากา กากา",
              },
              {
                id: "thai-practice-1-2-2",
                name: "แบบฝึกย่อยที่ 1.2.2 หหห สสส ฟฟฟ ววว",
                text: "หหห หหห หหห หหห หหห หหห หหห หหห หหห หหห สสส สสส สสส สสส สสส สสส สสส สสส สสส สสส ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ฟฟฟ ววว ววว ววว ววว ววว ววว ววว ววว ววว ววว",
              },
              {
                id: "thai-practice-1-2-3",
                name: "แบบฝึกย่อยที่ 1.2.3 ฟหกด  ่าสว",
                text: "ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด  ่าสว  ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว",
              },
              {
                id: "thai-practice-1-2-4",
                name: "แบบฝึกย่อยที่ 1.2.4 ฟหกด  ่าสว",
                text: "ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด  ่าสว  ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว",
              },
              {
                id: "thai-practice-1-2-5",
                name: "แบบฝึกย่อยที่ 1.2.5 ฟหกด  ่าสว",
                text: "ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด ฟหกด  ่าสว  ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว ่าสว",
              },
            ],
          },
          {
            id: "thai-session-1-3",
            name: "แบบฝึกหัดที่ 1.3: ผสมคำการพิมพ์ ฟ ห ก ด ่ า ส ว",
            levels: [
              {
                id: "thai-practice-1-3-1",
                name: "แบบฝึกย่อยที่ 1.3.1 ด่าว่า",
                text: "ด่าว่า ด่าว่า ด่าว่า ด่าว่า ด่าว่า ด่าว่า ด่าว่า ด่าว่า ด่าว่า ด่าว่า",
              },
              {
                id: "thai-practice-1-3-2",
                name: "แบบฝึกย่อยที่ 1.3.2 หาสาว",
                text: "หาสาว หาสาว หาสาว หาสาว หาสาว หาสาว หาสาว หาสาว หาสาว หาสาว",
              },
              {
                id: "thai-practice-1-3-3",
                name: "แบบฝึกย่อยที่ 1.3.3 สาวฟาด",
                text: "สาวฟาด สาวฟาด สาวฟาด สาวฟาด สาวฟาด สาวฟาด สาวฟาด สาวฟาด สาวฟาด สาวฟาด",
              },
              {
                id: "thai-practice-1-3-4",
                name: "แบบฝึกย่อยที่ 1.3.4 สาวก",
                text: "สาวก สาวก สาวก สาวก สาวก สาวก สาวก สาวก สาวก สาวก",
              },
              {
                id: "thai-practice-1-3-5",
                name: "แบบฝึกย่อยที่ 1.3.5 วาดดาว",
                text: "วาดดาว วาดดาว วาดดาว วาดดาว วาดดาว วาดดาว วาดดาว วาดดาว วาดดาว วาดดาว",
              },
            ],
          },
          {
            id: "thai-session-1-4",
            name: "แบบฝึกหัดที่ 1.4: เพื่อพัฒนา ฟ ห ก ด ่ า ส ว",
            levels: [
              {
                id: "thai-practice-1-4-1",
                name: "แบบฝึกย่อยที่ 1.4.1 หากสาวด่า",
                text: "หากสาวด่า หาสาวว่า หากหาด หากสาวด่า หาสาวว่า หาฟาก",
              },
              {
                id: "thai-practice-1-4-2",
                name: "แบบฝึกย่อยที่ 1.4.2 หากสาวด่า",
                text: "หากสาวด่า หาสาวว่า หากหาด หากสาวด่า หาสาวว่า หาฟาก",
              },
              {
                id: "thai-practice-1-4-3",
                name: "แบบฝึกย่อยที่ 1.4.3 หากสาวด่า",
                text: "หากสาวด่า หาสาวว่า หากหาด หากสาวด่า หาสาวว่า หาฟาก",
              },
              {
                id: "thai-practice-1-4-4",
                name: "แบบฝึกย่อยที่ 1.4.4 ฟ่าหาว่ากาสวดาวหก",
                text: "ฟ่าหาว่ากาสวดาวหก ฟ่าหาว่ากาสวดาวหก ฟ่าหาว่ากาสวดาวหก",
              },
              {
                id: "thai-practice-1-4-5",
                name: "แบบฝึกย่อยที่ 1.4.5 ฟ่าหาว่ากาสวดาวหก",
                text: "ฟ่าหาว่ากาสวดาวหก ฟ่าหาว่ากาสวดาวหก ฟ่าหาว่ากาสวดาวหก",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-2",
        name: "หน่วยที่ 2: การพิมพ์แป้นอักษร พ อ -ี ท",
        sessions: [
          {
            id: "thai-session-2-1",
            name: "แบบฝึกหัดที่ 2.1: การพิมพ์แป้นอักษร พ อ -ี ท",
            levels: [
              {
                id: "thai-practice-2-1-1",
                name: "แบบฝึกย่อยที่ 2.1.1 ดพพด",
                text: "ดพพด ดพพด ดพพด ดพพด ดพพด ดพพด ดพพด ดพพด ดพพด ดพพด",
              },
              {
                id: "thai-practice-2-1-2",
                name: "แบบฝึกย่อยที่ 2.1.2 ดออด",
                text: "ดออด ดออด ดออด ดออด ดออด ดออด ดออด ดออด ดออด ดออด ดออด",
              },
              {
                id: "thai-practice-2-1-3",
                name: "แบบฝึกย่อยที่ 2.1.3 ที่",
                text: "ที่ ที่ ที่ ที่ ที่ ที่ ที่ ที่ ที่ ที่",
              },
              {
                id: "thai-practice-2-1-4",
                name: "แบบฝึกย่อยที่ 2.1.4 ท่า",
                text: "ท่า ท่า ท่า ท่า ท่า ท่า ท่า ท่า ท่า ท่า",
              },
              {
                id: "thai-practice-2-1-5",
                name: "แบบฝึกย่อยที่ 2.1.5 ที่ท่า",
                text: "ที่ท่า ที่ท่า ที่ท่า ที่ท่า ที่ท่า ที่ท่า ที่ท่า ที่ท่า ที่ท่า ที่ท่า",
              },
            ],
          },
          {
            id: "thai-session-2-2",
            name: "แบบฝึกหัดที่ 2.2: ทบทวนการพิมพ์แป้นอักษร พ อ -ี ท",
            levels: [
              {
                id: "thai-practice-2-2-1",
                name: "แบบฝึกย่อยที่ 2.2.1 กออด",
                text: "กออด กออด กออด กออด กออด กออด กออด กออด กออด กออด",
              },
              {
                id: "thai-practice-2-2-2",
                name: "แบบฝึกย่อยที่ 2.2.2 พออด",
                text: "พออด พออด พออด พออด พออด พออด พออด พออด พออด พออด",
              },
              {
                id: "thai-practice-2-2-3",
                name: "แบบฝึกย่อยที่ 2.2.3 ฟออด",
                text: "ฟออด ฟออด ฟออด ฟออด ฟออด ฟออด ฟออด ฟออด ฟออด ฟออด",
              },
              {
                id: "thai-practice-2-2-4",
                name: "แบบฝึกย่อยที่ 2.2.4 ท่าที",
                text: "ท่าที ท่าที ท่าที ท่าที ท่าที ท่าที ท่าที ท่าที ท่าที ท่าที",
              },
              {
                id: "thai-practice-2-2-5",
                name: "แบบฝึกย่อยที่ 2.2.5 ทวี",
                text: "ทวี ทวี ทวี ทวี ทวี ทวี ทวี ทวี ทวี ทวี",
              },
            ],
          },
          {
            id: "thai-session-2-3",
            name: "แบบฝึกหัดที่ 2.3: ผสมคำการพิมพ์ พ อ -ี ท",
            levels: [
              {
                id: "thai-practice-2-3-1",
                name: "แบบฝึกย่อยที่ 2.3.1 กอดที่",
                text: "กอดที่ กอดที่ กอดที่ กอดที่ กอดที่ กอดที่ กอดที่ กอดที่ กอดที่ กอดที่",
              },
              {
                id: "thai-practice-2-3-2",
                name: "แบบฝึกย่อยที่ 2.3.2 พี่สาว",
                text: "พี่สาว พี่สาว พี่สาว พี่สาว พี่สาว พี่สาว พี่สาว พี่สาว พี่สาว พี่สาว",
              },
              {
                id: "thai-practice-2-3-3",
                name: "แบบฝึกย่อยที่ 2.3.3 ที่ทอด",
                text: "ที่ทอด ที่ทอด ที่ทอด ที่ทอด ที่ทอด ที่ทอด ที่ทอด ที่ทอด ที่ทอด ที่ทอด",
              },
              {
                id: "thai-practice-2-3-4",
                name: "แบบฝึกย่อยที่ 2.3.4 ออกหา",
                text: "ออกหา ออกหา ออกหา ออกหา ออกหา ออกหา ออกหา ออกหา ออกหา ออกหา",
              },
              {
                id: "thai-practice-2-3-5",
                name: "แบบฝึกย่อยที่ 2.3.5 ท่าฟาก",
                text: "ท่าฟาก ท่าฟาก ท่าฟาก ท่าฟาก ท่าฟาก ท่าฟาก ท่าฟาก ท่าฟาก ท่าฟาก ท่าฟาก",
              },
            ],
          },
          {
            id: "thai-session-2-4",
            name: "แบบฝึกหัดที่ 2.4: เพื่อพัฒนา พ อ -ี ท",
            levels: [
              {
                id: "thai-practice-2-4-1",
                name: "แบบฝึกย่อยที่ 2.4.1 พี่สาวทากาว",
                text: "พี่สาวทากาว พี่สาวหาว ท่าหาด ที่หาด ที่ทาพอดี ทาพอกสีดีพอ",
              },
              {
                id: "thai-practice-2-4-2",
                name: "แบบฝึกย่อยที่ 2.4.2 พี่สาวทากาวที่หาด",
                text: "พี่สาวทากาวที่หาด พี่สาวทากาวที่หาด พี่สาวทากาวที่หาด",
              },
              {
                id: "thai-practice-2-4-3",
                name: "แบบฝึกย่อยที่ 2.4.3 พี่สาวทาสีพอดี",
                text: "พี่สาวทาสีพอดี พี่สาวทาสีพอดี พี่สาวทาสีพอดี พี่ดี",
              },
              {
                id: "thai-practice-2-4-4",
                name: "แบบฝึกย่อยที่ 2.4.4 หากว่าพี่ทาสีพอดี",
                text: "หากว่าพี่ทาสีพอดี หากว่าพี่ทาสีพอดี หากว่าทาสีดีพอ",
              },
              {
                id: "thai-practice-2-4-5",
                name: "แบบฝึกย่อยที่ 2.4.5 ว่าวฟอกสีที่หาด",
                text: "ว่าวฟอกสีที่หาด ว่าวฟอกสีที่หาด ว่าวฟอกสีที่หาดดาว",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-3",
        name: "หน่วยที่ 3: การพิมพ์แป้นอักษร ำ แ ร ม",
        sessions: [
          {
            id: "thai-session-3-1",
            name: "แบบฝึกหัดที่ 3.1: การพิมพ์แป้นอักษร ำ แ ร ม",
            levels: [
              {
                id: "thai-practice-3-1-1",
                name: "แบบฝึกย่อยที่ 3.1.1 กำก",
                text: "กำก กำก กำก กำก กำก กำก กำก กำก กำก กำก",
              },
              {
                id: "thai-practice-3-1-2",
                name: "แบบฝึกย่อยที่ 3.1.2 กแก",
                text: "กแก กแก กแก กแก กแก กแก กแก กแก กแก กแก",
              },
              {
                id: "thai-practice-3-1-3",
                name: "แบบฝึกย่อยที่ 3.1.3 รารา",
                text: "รารา รารา รารา รารา รารา รารา รารา รารา รารา รารา",
              },
              {
                id: "thai-practice-3-1-4",
                name: "แบบฝึกย่อยที่ 3.1.4 มามา",
                text: "มามา มามา มามา มามา มามา มามา มามา มามา มามา มามา",
              },
              {
                id: "thai-practice-3-1-5",
                name: "แบบฝึกย่อยที่ 3.1.5 รามา",
                text: "รามา รามา รามา รามา รามา รามา รามา รามา รามา รามา",
              },
            ],
          },
          {
            id: "thai-session-3-2",
            name: "แบบฝึกหัดที่ 3.2: ทบทวนการพิมพ์แป้นอักษร ำ แ ร ม",
            levels: [
              {
                id: "thai-practice-3-2-1",
                name: "แบบฝึกย่อยที่ 3.2.1 กำกำกา",
                text: "กำกำกา กำกำกา กำกำกา กำกำกา กำกำกา กำกำกา กำกำกา กำกำกา กำกำกา กำกำกา",
              },
              {
                id: "thai-practice-3-2-2",
                name: "แบบฝึกย่อยที่ 3.2.2 กกแก",
                text: "กกแก กกแก กกแก กกแก กกแก กกแก กกแก กกแก กกแก กกแก",
              },
              {
                id: "thai-practice-3-2-3",
                name: "แบบฝึกย่อยที่ 3.2.3 รรารา",
                text: "รรารา รรารา รรารา รรารา รrรารา รรารา รรารา รรารา รรารา รรารา",
              },
              {
                id: "thai-practice-3-2-4",
                name: "แบบฝึกย่อยที่ 3.2.4 มมามา",
                text: "มมามา มมามา มมามา มมามา มมามา มมามา มมามา มมามา มมามา มมามา",
              },
              {
                id: "thai-practice-3-2-5",
                name: "แบบฝึกย่อยที่ 3.2.5 กำราม",
                text: "กำราม กำราม กำราม กำราม กำราม กำราม กำราม กำราม กำราม กำราม",
              },
            ],
          },
          {
            id: "thai-session-3-3",
            name: "แบบฝึกหัดที่ 3.3: ผสมคำการพิมพ์ ำ แ ร ม",
            levels: [
              {
                id: "thai-practice-3-3-1",
                name: "แบบฝึกย่อยที่ 3.3.1 แม่หมาก",
                text: "แม่หมาก แม่หมาก แม่หมาก แม่หมาก แม่หมาก แม่หมาก แม่หมาก แม่หมาก แม่หมาก แม่หมาก",
              },
              {
                id: "thai-practice-3-3-2",
                name: "แบบฝึกย่อยที่ 3.3.2 หาที่รำ",
                text: "หาที่รำ หาที่รำ หาที่รำ หาที่รำ หาที่รำ หาที่รำ หาที่รำ หาที่รำ หาที่รำ หาที่รำ",
              },
              {
                id: "thai-practice-3-3-3",
                name: "แบบฝึกย่อยที่ 3.3.3 ทาสีดำ",
                text: "ทาสีดำ ทาสีดำ ทาสีดำ ทาสีดำ ทาสีดำ ทาสีดำ ทาสีดำ ทาสีดำ ทาสีดำ ทาสีดำ",
              },
              {
                id: "thai-practice-3-3-4",
                name: "แบบฝึกย่อยที่ 3.3.4 สาวแก่",
                text: "สาวแก่ สาวแก่ สาวแก่ สาวแก่ สาวแก่ สาวแก่ สาวแก่ สาวแก่ สาวแก่ สาวแก่ ",
              },
              {
                id: "thai-practice-3-3-5",
                name: "แบบฝึกย่อยที่ 3.3.5 พรพรหม",
                text: "พรพรหม พรพรหม พรพรหม พรพรหม พรพรหม พรพรหม พรพรหม พรพรหม พรพรหม พรพรหม",
              },
            ],
          },
          {
            id: "thai-session-3-4",
            name: "แบบฝึกหัดที่ 3.4: เพื่อพัฒนา ำ แ ร ม",
            levels: [
              {
                id: "thai-practice-3-4-1",
                name: "แบบฝึกย่อยที่ 3.4.1 พี่ดาวมาหาแม่",
                text: "พี่ดาวมาหาแม่ พี่ดาวมาหาแม่ พี่ดาวมาหาแม่ พี่ดาวมาหาแม่",
              },
              {
                id: "thai-practice-3-4-2",
                name: "แบบฝึกย่อยที่ 3.4.2 พ่อมาหาพี่สาว",
                text: "พ่อมาหาพี่สาว พ่อมาหาพี่สาว พ่อมาหาพี่สาว พ่อมาหาพี่สาว",
              },
              {
                id: "thai-practice-3-4-3",
                name: "แบบฝึกย่อยที่ 3.4.3 ดอกหอมดีมาก",
                text: "ดอกหอมดีมาก ดอกหอมดีมาก ดอกหอมดีมาก ดอกหอมดีมาก",
              },
              {
                id: "thai-practice-3-4-4",
                name: "แบบฝึกย่อยที่ 3.4.4 แม่สีดามาหาพี่สาว",
                text: "แม่สีดามาหาพี่สาว แม่สีดามาหาพี่สาว แม่สีดามาหาพี่สาว แม่สีดามาหาพี่สาว",
              },
              {
                id: "thai-practice-3-4-5",
                name: "แบบฝึกย่อยที่ 3.4.5 ทำดีมีออม",
                text: "ทำดีมีออม ทำดีมีออม ทำดีมีออม ทำดีมีออม ทำดีมีหามา",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-4",
        name: "หน่วยที่ 4: การพิมพ์แป้นอักษร ไ ป น ใ",
        sessions: [
          {
            id: "thai-session-4-1",
            name: "แบบฝึกหัดที่ 4.1: การพิมพ์แป้นอักษร ไ ป น ใ",
            levels: [
              {
                id: "thai-practice-4-1-1",
                name: "แบบฝึกย่อยที่ 4.1.1 ไหไห",
                text: "ไหไห ไหไห ไหไห ไหไห ไหไห ไหไห ไหไห ไหไห ไหไห ไหไห",
              },
              {
                id: "thai-practice-4-1-2",
                name: "แบบฝึกย่อยที่ 4.1.2 หปปห",
                text: "หปปห หปปห หปปห หปปห หปปห หปปห หปปห หปปห หปปห หปปห",
              },
              {
                id: "thai-practice-4-1-3",
                name: "แบบฝึกย่อยที่ 4.1.3 สนนส",
                text: "สนนส สนนส สนนส สนนส สนนส สนนส สนนส สนนส สนนส สนนส",
              },
              {
                id: "thai-practice-4-1-4",
                name: "แบบฝึกย่อยที่ 4.1.4 ใสใส",
                text: "ใสใส ใสใส ใสใส ใสใส ใสใส ใสใส ใสใส ใสใส ใสใส ใสใส",
              },
              {
                id: "thai-practice-4-1-5",
                name: "แบบฝึกย่อยที่ 4.1.5 ไปใสใน",
                text: "ไปใสใน ไปใสใน ไปใสใน ไปใสใน ไปใสใน ไปใสใน ไปใสใน ไปใสใน ไปใสใน ไปใสใน",
              },
            ],
          },
          {
            id: "thai-session-4-2",
            name: "แบบฝึกหัดที่ 4.2: ทบทวนการพิมพ์แป้นอักษร ไ ป น ใ",
            levels: [
              {
                id: "thai-practice-4-2-1",
                name: "แบบฝึกย่อยที่ 4.2.1 ไหน",
                text: "ไหน ไหน ไหน ไหน ไหน ไหน ไหน ไหน ไหน ไหน",
              },
              {
                id: "thai-practice-4-2-2",
                name: "แบบฝึกย่อยที่ 4.2.2 ไปไหน",
                text: "ไปไหน ไปไหน ไปไหน ไปไหน ไปไหน ไปไหน ไปไหน ไปไหน ไปไหน ไปไหน",
              },
              {
                id: "thai-practice-4-2-3",
                name: "แบบฝึกย่อยที่ 4.2.3 ในไห",
                text: "ในไห ในไห ในไห ในไห ในไห ในไห ในไห ในไห ในไห ในไห",
              },
              {
                id: "thai-practice-4-2-4",
                name: "แบบฝึกย่อยที่ 4.2.4 สนในไห",
                text: "สนในไห สนในไห สนในไห สนในไห สนในไห สนในไห สนในไห สนในไห สนในไห สนในไห",
              },
              {
                id: "thai-practice-4-2-5",
                name: "แบบฝึกย่อยที่ 4.2.5 ไสไปไหน",
                text: "ไสไปไหน ไสไปไหน ไสไปไหน ไสไปไหน ไสไปไหน ไสไปไหน ไสไปไหน ไสไปไหน ไสไปไหน ไสไปไหน",
              },
            ],
          },
          {
            id: "thai-session-4-3",
            name: "แบบฝึกหัดที่ 4.3: ผสมคำการพิมพ์ ไ ป น ใ",
            levels: [
              {
                id: "thai-practice-4-3-1",
                name: "แบบฝึกย่อยที่ 4.3.1 สอน",
                text: "สอน สอน สอน สอน สอน สอน สอน สอน สอน สอน",
              },
              {
                id: "thai-practice-4-3-2",
                name: "แบบฝึกย่อยที่ 4.3.2 ไปหา",
                text: "ไปหา ไปหา ไปหา ไปหา ไปหา ไปหา ไปหา ไปหา ไปหา ไปหา",
              },
              {
                id: "thai-practice-4-3-3",
                name: "แบบฝึกย่อยที่ 4.3.3 ในนา",
                text: "ในนา ในนา ในนา ในนา ในนา ในนา ในนา ในนา ในนา ในนา",
              },
              {
                id: "thai-practice-4-3-4",
                name: "แบบฝึกย่อยที่ 4.3.4 ไปนา",
                text: "ไปนา ไปนา ไปนา ไปนา ไปนา ไปนา ไปนา ไปนา ไปนา ไปนา",
              },
              {
                id: "thai-practice-4-3-5",
                name: "แบบฝึกย่อยที่ 4.3.5 น่าไปหา",
                text: "น่าไปหา น่าไปหา น่าไปหา น่าไปหา น่าไปหา น่าไปหา น่าไปหา น่าไปหา น่าไปหา น่าไปหา",
              },
            ],
          },
          {
            id: "thai-session-4-4",
            name: "แบบฝึกหัดที่ 4.4: เพื่อพัฒนา ไ ป น ใ",
            levels: [
              {
                id: "thai-practice-4-4-1",
                name: "แบบฝึกย่อยที่ 4.4.1 พี่สาวไปหาที่ในนา",
                text: "พี่สาวไปหาที่ในนา พี่สาวไปหาที่ในนา พี่สาวไปหาที่ในนา พี่สาวไปหาที่ในนา",
              },
              {
                id: "thai-practice-4-4-2",
                name: "แบบฝึกย่อยที่ 4.4.2 กำไรที่หามามากพอนำไปทำนา",
                text: "กำไรที่หามามากพอนำไปทำนา กำไรที่หามามากพอนำไปทำนา กำไรที่หามามากพอนำไปทำนา",
              },
              {
                id: "thai-practice-4-4-3",
                name: "แบบฝึกย่อยที่ 4.4.3 หมอไม่มาหา",
                text: "หมอไม่มาหา พ่อพาแม่ไปหาหมอ แม่มีท่าอาการไม่ดี อาการอ่อนมาก",
              },
              {
                id: "thai-practice-4-4-4",
                name: "แบบฝึกย่อยที่ 4.4.4 หากทหารมา",
                text: "หากทหารมา ทำท่าไปทำไร่ มีไฟ ไปหาแมวดำ ในนาน่ามีแมวดำ ท่าไม่ดี",
              },
              {
                id: "thai-practice-4-4-5",
                name: "แบบฝึกย่อยที่ 4.4.5 ทีแรกหากพ่อแม่ไม่ออกไปหาพี่สาว",
                text: "ทีแรกหากพ่อแม่ไม่ออกไปหาพี่สาวที่ในนาดำไฟหมดแน่นอน พ่อแม่นอน",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-5",
        name: "หน่วยที่ 5: การพิมพ์แป้นอักษร ๆ ผ ย ฝ",
        sessions: [
          {
            id: "thai-session-5-1",
            name: "แบบฝึกหัดที่ 5.1: การพิมพ์แป้นอักษร ๆ ผ ย ฝ",
            levels: [
              {
                id: "thai-practice-5-1-1",
                name: "แบบฝึกย่อยที่ 5.1.1 ๆฟๆฟ",
                text: "ๆฟๆฟ ๆฟๆฟ ๆฟๆฟ ๆฟๆฟ ๆฟๆฟ ๆฟๆฟ ๆฟๆฟ ๆฟๆฟ ๆฟๆฟ ๆฟๆฟ",
              },
              {
                id: "thai-practice-5-1-2",
                name: "แบบฝึกย่อยที่ 5.1.2 ผฟผฟ",
                text: "ผฟผฟ ผฟผฟ ผฟผฟ ผฟผฟ ผฟผฟ ผฟผฟ ผฟผฟ ผฟผฟ ผฟผฟ ผฟผฟ",
              },
              {
                id: "thai-practice-5-1-3",
                name: "แบบฝึกย่อยที่ 5.1.3 ยวยว",
                text: "ยวยว ยวยว ยวยว ยวยว ยวยว ยวยว ยวยว ยวยว ยวยว ยวยว",
              },
              {
                id: "thai-practice-5-1-4",
                name: "แบบฝึกย่อยที่ 5.1.4 ฝวฝว",
                text: "ฝวฝว ฝวฝว ฝวฝว ฝวฝว ฝวฝว ฝวฝว ฝวฝว ฝวฝว ฝวฝว ฝวฝว",
              },
              {
                id: "thai-practice-5-1-5",
                name: "แบบฝึกย่อยที่ 5.1.5 ๆฟๆฟ ยวยว ผฟผฟ ฝวฝว",
                text: "ๆฟๆฟ ยวยว ผฟผฟ ฝวฝว ๆฟๆฟ ยวยว ผฟผฟ ฝวฝว ๆฟๆฟ ยวยว ผฟผฟ ฝวฝว",
              },
            ],
          },
          {
            id: "thai-session-5-2",
            name: "แบบฝึกหัดที่ 5.2: ทบทวนการพิมพ์แป้นอักษร ๆ ผ ย ฝ",
            levels: [
              {
                id: "thai-practice-5-2-1",
                name: "แบบฝึกย่อยที่ 5.2.1 ฝาย",
                text: "ฝาย ฝาย ฝาย ฝาย ฝาย ฝาย ฝาย ฝาย ฝาย ฝาย",
              },
              {
                id: "thai-practice-5-2-2",
                name: "แบบฝึกย่อยที่ 5.2.2 ฝ่าย",
                text: "ฝ่าย ฝ่าย ฝ่าย ฝ่าย ฝ่าย ฝ่าย ฝ่าย ฝ่าย ฝ่าย ฝ่าย ",
              },
              {
                id: "thai-practice-5-2-3",
                name: "แบบฝึกย่อยที่ 5.2.3 ผ่าๆ",
                text: "ผ่าๆ ผ่าๆ ผ่าๆ ผ่าๆ ผ่าๆ ผ่าๆ ผ่าๆ ผ่าๆ ผ่าๆ ผ่าๆ",
              },
              {
                id: "thai-practice-5-2-4",
                name: "แบบฝึกย่อยที่ 5.2.4 ผ่าน",
                text: "ผ่าน ผ่าน ผ่าน ผ่าน ผ่าน ผ่าน ผ่าน ผ่าน ผ่าน ผ่าน",
              },
              {
                id: "thai-practice-5-2-5",
                name: "แบบฝึกย่อยที่ 5.2.5 ฝาก",
                text: "ฝาก ฝาก ฝาก ฝาก ฝาก ฝาก ฝาก ฝาก ฝาก ฝาก",
              },
            ],
          },
          {
            id: "thai-session-5-3",
            name: "แบบฝึกหัดที่ 5.3: ผสมคำการพิมพ์ ๆ ผ ย ฝ",
            levels: [
              {
                id: "thai-practice-5-3-1",
                name: "แบบฝึกย่อยที่ 5.3.1 ยายมา",
                text: "ยายมา ยายมา ยายมา ยายมา ยายมา ยายมา ยายมา ยายมา ยายมา ยายมา",
              },
              {
                id: "thai-practice-5-3-2",
                name: "แบบฝึกย่อยที่ 5.3.2 ผ่าหมาก",
                text: "ผ่าหมาก ผ่าหมาก ผ่าหมาก ผ่าหมาก ผ่าหมาก ผ่าหมาก ผ่าหมาก ผ่าหมาก ผ่าหมาก ผ่าหมาก",
              },
              {
                id: "thai-practice-5-3-3",
                name: "แบบฝึกย่อยที่ 5.3.3 มาก ๆ",
                text: "มาก ๆ มาก ๆ มาก ๆ มาก ๆ มาก ๆ มาก ๆ มาก ๆ มาก ๆ มาก ๆ มาก ๆ",
              },
              {
                id: "thai-practice-5-3-4",
                name: "แบบฝึกย่อยที่ 5.3.4 ฝ่ายแรก",
                text: "ฝ่ายแรก ฝ่ายแรก ฝ่ายแรก ฝ่ายแรก ฝ่ายแรก ฝ่ายแรก ฝ่ายแรก ฝ่ายแรก ฝ่ายแรก ฝ่ายแรก",
              },
              {
                id: "thai-practice-5-3-5",
                name: "แบบฝึกย่อยที่ 5.3.5 สวยดี",
                text: "สวยดี สวยดี สวยดี สวยดี สวยดี สวยดี สวยดี สวยดี สวยดี สวยดี",
              },
            ],
          },
          {
            id: "thai-session-5-4",
            name: "แบบฝึกหัดที่ 5.4: เพื่อพัฒนา ๆ ผ ย ฝ",
            levels: [
              {
                id: "thai-practice-5-4-1",
                name: "แบบฝึกย่อยที่ 5.4.1 สาวสวยมาก",
                text: "สาวสวยมาก ๆ มาหาที่ทำฝาย ผ่านมาพอดี สาวสวยมา ๆ มาหาที่ทำฝาย ผ่านมาพอดี",
              },
              {
                id: "thai-practice-5-4-2",
                name: "แบบฝึกย่อยที่ 5.4.2 ยายปานป่วยมาก",
                text: "ยายปานป่วยมาก ๆ ไปหาหมอผ่าฝี ยายปานป่าวยมาก ๆ ไปหาหมอแดนผ่าฝี",
              },
              {
                id: "thai-practice-5-4-3",
                name: "แบบฝึกย่อยที่ 5.4.3 ทหารผ่านมาที่นี่",
                text: "ทหารผ่านมาที่นี่ มีไผ่มามากมาย ฝ่าด่านไปหาไผ่มา ได้ไผ่หวานมา",
              },
              {
                id: "thai-practice-5-4-4",
                name: "แบบฝึกย่อยที่ 5.4.4 พ่อแม่ฝากไก่มา",
                text: "พ่อแม่ฝากไก่มา ไก่อร่อยดี มีปากไก่ อกไก่ ผมไม่ผอม ผ่อมผ่านมา",
              },
              {
                id: "thai-practice-5-4-5",
                name: "แบบฝึกย่อยที่ 5.4.5 ผมฝากไก่สาวดาวมา",
                text: "ผมฝากไก่สามดาวมา ไก่สี่ดาวไม่มี ยามย้ายมานอนที่นี่ ผมไม่มี ๆ",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-6",
        name: "หน่วยที่ 6: การพิมพ์แป้นอักษร ง บ ล",
        sessions: [
          {
            id: "thai-session-6-1",
            name: "แบบฝึกหัดที่ 6.1: การพิมพ์แป้นอักษร ง บ ล",
            levels: [
              {
                id: "thai-practice-6-1-1",
                name: "แบบฝึกย่อยที่ 6.1.1 วงงว",
                text: "วงงว วงงว วงงว วงงว วงงว วงงว วงงว วงงว วงงว วงงว",
              },
              {
                id: "thai-practice-6-1-2",
                name: "แบบฝึกย่อยที่ 6.1.2 วบบว",
                text: "วบบว วบบว วบบว วบบว วบบว วบบว วบบว วบบว วบบว วบบว",
              },
              {
                id: "thai-practice-6-1-3",
                name: "แบบฝึกย่อยที่ 6.1.3 วลลว",
                text: "วลลว วลลว วลลว วลลว วลลว วลลว วลลว วลลว วลลว วลลว",
              },
              {
                id: "thai-practice-6-1-4",
                name: "แบบฝึกย่อยที่ 6.1.4 วยบลว",
                text: "วยบลว วยบลว วยบลว วยบลว วยบลว วยบลว วยบลว วยบลว วยบลว วยบลว",
              },
              {
                id: "thai-practice-6-1-5",
                name: "แบบฝึกย่อยที่ 6.1.5 วยงว",
                text: "วยงว วยงว วยงว วยงว วยงว วยงว วยงว วยงว วยงว วยงว",
              },
            ],
          },
          {
            id: "thai-session-6-2",
            name: "แบบฝึกหัดที่ 6.2: ทบทวนการพิมพ์แป้นอักษร ง บ ล",
            levels: [
              {
                id: "thai-practice-6-2-1",
                name: "แบบฝึกย่อยที่ 6.2.1 บวบ",
                text: "บวบ บวบ บวบ บวบ บวบ บวบ บวบ บวบ บวบ บวบ",
              },
              {
                id: "thai-practice-6-2-2",
                name: "แบบฝึกย่อยที่ 6.2.2 ลาบ",
                text: "ลาบ ลาบ ลาบ ลาบ ลาบ ลาบ ลาบ ลาบ ลาบ ลาบ",
              },
              {
                id: "thai-practice-6-2-3",
                name: "แบบฝึกย่อยที่ 6.2.3 วาง",
                text: "วาง วาง วาง วาง วาง วาง วาง วาง วาง วาง",
              },
              {
                id: "thai-practice-6-2-4",
                name: "แบบฝึกย่อยที่ 6.2.4 ง่วง",
                text: "ง่วง ง่วง ง่วง ง่วง ง่วง ง่วง ง่วง ง่วง ง่วง ง่วง",
              },
              {
                id: "thai-practice-6-2-5",
                name: "แบบฝึกย่อยที่ 6.2.5 ง่าย",
                text: "ง่าย ง่าย ง่าย ง่าย ง่าย ง่าย ง่าย ง่าย ง่าย ง่าย",
              },
            ],
          },
          {
            id: "thai-session-6-3",
            name: "แบบฝึกหัดที่ 6.3: ผสมคำการพิมพ์ ง บ ล",
            levels: [
              {
                id: "thai-practice-6-3-1",
                name: "แบบฝึกย่อยที่ 6.3.1 งานง่าย",
                text: "งานง่าย งานง่าย งานง่าย งานง่าย งานง่าย งานง่าย งานง่าย งานง่าย งานง่าย งานง่าย",
              },
              {
                id: "thai-practice-6-3-2",
                name: "แบบฝึกย่อยที่ 6.3.2 ลางาน",
                text: "ลางาน ลางาน ลางาน ลางาน ลางาน ลางาน ลางาน ลางาน ลางาน ลางาน",
              },
              {
                id: "thai-practice-6-3-3",
                name: "แบบฝึกย่อยที่ 6.3.3 บอบบาง",
                text: "บอบบาง บอบบาง บอบบาง บอบบาง บอบบาง บอบบาง บอบบาง บอบบาง บอบบาง บอบบาง",
              },
              {
                id: "thai-practice-6-3-4",
                name: "แบบฝึกย่อยที่ 6.3.4 ฟองลอย",
                text: "ฟองลอย ฟองลอย ฟองลอย ฟองลอย ฟองลอย ฟองลอย ฟองลอย ฟองลอย ฟองลอย ฟองลอย",
              },
              {
                id: "thai-practice-6-3-5",
                name: "แบบฝึกย่อยที่ 6.3.5 กลาง",
                text: "กลาง กลาง กลาง กลาง กลาง กลาง กลาง กลาง กลาง กลาง",
              },
            ],
          },
          {
            id: "thai-session-6-4",
            name: "แบบฝึกหัดที่ 6.4: เพื่อพัฒนา ง บ ล",
            levels: [
              {
                id: "thai-practice-6-4-1",
                name: "แบบฝึกย่อยที่ 6.4.1 หน่วยงานที่มีงานทำ",
                text: "หน่วยงานที่มีงานทำมากมายหลายอย่าง งานที่ทำนาน ๆ มีการสอบผ่าน",
              },
              {
                id: "thai-practice-6-4-2",
                name: "แบบฝึกย่อยที่ 6.4.2 การลบรอยแผลที่มีไฟ",
                text: "การลบรอยแผลที่มีไฟ ไม่มียา ยาหายาก ฝากหมอไปหายามา หายดีแน่ ๆ",
              },
              {
                id: "thai-practice-6-4-3",
                name: "แบบฝึกย่อยที่ 6.4.3 ทหารผ่านมาที่นี่",
                text: "ล่วงผ่านหลาย ๆ ปี ไม่มีปลาว่ายผ่านมา บอกว่ามีแดดแรงมาก ๆ เลย",
              },
              {
                id: "thai-practice-6-4-4",
                name: "แบบฝึกย่อยที่ 6.4.4 ปลายทางที่ผ่านมา",
                text: "ปลายทางที่ผ่านมา หลายฝ่ายพยายามหาแหล่งที่มีปลาสวยงามปลาหายาก",
              },
              {
                id: "thai-practice-6-4-5",
                name: "แบบฝึกย่อยที่ 6.4.5 การทำดีบางทีนานกว่าการทำไม่ดี",
                text: "การทำดีบางทีนานกว่าการทำไม่ดี ลองทำดีผลที่ดีมีหลายอย่าง ๆ ดี",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-7",
        name: "หน่วยที่ 7: การพิมพ์แป้นอักษร เ ะ -้",
        sessions: [
          {
            id: "thai-session-7-1",
            name: "แบบฝึกหัดที่ 7.1: การพิมพ์แป้นอักษร เ ะ -้",
            levels: [
              {
                id: "thai-practice-7-1-1",
                name: "แบบฝึกย่อยที่ 7.1.1 ดเดดเด",
                text: "ดเดดเด ดเดดเด ดเดดเด ดเดดเด ดเดดเด ดเดดเด ดเดดเด ดเดดเด ดเดดเด ดเดดเด",
              },
              {
                id: "thai-practice-7-1-2",
                name: "แบบฝึกย่อยที่ 7.1.2 ดะดดะด",
                text: "ดะดดะด ดะดดะด ดะดดะด ดะดดะด ดะดดะด ดะดดะด ดะดดะด ดะดดะด ดะดดะด ดะดดะด",
              },
              {
                id: "thai-practice-7-1-3",
                name: "แบบฝึกย่อยที่ 7.1.3 ท้า",
                text: "ท้า ท้า ท้า ท้า ท้า ท้า ท้า ท้า ท้า ท้า",
              },
              {
                id: "thai-practice-7-1-4",
                name: "แบบฝึกย่อยที่ 7.1.4 ดเดะด",
                text: "ดเดะด ดเดะด ดเดะด ดเดะด ดเดะด ดเดะด ดเดะด ดเดะด ดเดะด ดเดะด",
              },
              {
                id: "thai-practice-7-1-5",
                name: "แบบฝึกย่อยที่ 7.1.5 ท่าท้า",
                text: "ท่าท้า ท่าท้า ท่าท้า ท่าท้า ท่าท้า ท่าท้า ท่าท้า ท่าท้า ท่าท้า ท่าท้า",
              },
            ],
          },
          {
            id: "thai-session-7-2",
            name: "แบบฝึกหัดที่ 7.2: ทบทวนการพิมพ์แป้นอักษร เ ะ -้",
            levels: [
              {
                id: "thai-practice-7-2-1",
                name: "แบบฝึกย่อยที่ 7.2.1 เดา",
                text: "เดา เดา เดา เดา เดา เดา เดา เดา เดา เดา",
              },
              {
                id: "thai-practice-7-2-2",
                name: "แบบฝึกย่อยที่ 7.2.2 เดาเอา",
                text: "เดาเอา เดาเอา เดาเอา เดาเอา เดาเอา เดาเอา เดาเอา เดาเอา เดาเอา เดาเอา",
              },
              {
                id: "thai-practice-7-2-3",
                name: "แบบฝึกย่อยที่ 7.2.3 ดะดา",
                text: "ดะดา ดะดา ดะดา ดะดา ดะดา ดะดา ดะดา ดะดา ดะดา ดะดา",
              },
              {
                id: "thai-practice-7-2-4",
                name: "แบบฝึกย่อยที่ 7.2.4 เก้า",
                text: "เก้า เก้า เก้า เก้า เก้า เก้า เก้า เก้า เก้า เก้า",
              },
              {
                id: "thai-practice-7-2-5",
                name: "แบบฝึกย่อยที่ 7.2.5 เท้า",
                text: "เท้า เท้า เท้า เท้า เท้า เท้า เท้า เท้า เท้า เท้า",
              },
            ],
          },
          {
            id: "thai-session-7-3",
            name: "แบบฝึกหัดที่ 7.3: ผสมคำการพิมพ์ เ ะ -้",
            levels: [
              {
                id: "thai-practice-7-3-1",
                name: "แบบฝึกย่อยที่ 7.3.1 ก้าวเท้า",
                text: "ก้าวเท้า ก้าวเท้า ก้าวเท้า ก้าวเท้า ก้าวเท้า ก้าวเท้า ก้าวเท้า ก้าวเท้า ก้าวเท้า ก้าวเท้า",
              },
              {
                id: "thai-practice-7-3-2",
                name: "แบบฝึกย่อยที่ 7.3.2 พระดำ",
                text: "พระดำ พระดำ พระดำ พระดำ พระดำ พระดำ พระดำ พระดำ พระดำ พระดำ",
              },
              {
                id: "thai-practice-7-3-3",
                name: "แบบฝึกย่อยที่ 7.3.3 ก้าวหน้า",
                text: "ก้าวหน้า ก้าวหน้า ก้าวหน้า ก้าวหน้า ก้าวหน้า ก้าวหน้า ก้าวหน้า ก้าวหน้า ก้าวหน้า ก้าวหน้า",
              },
              {
                id: "thai-practice-7-3-4",
                name: "แบบฝึกย่อยที่ 7.3.4 กระทะ",
                text: "กระทะ กระทะ กระทะ กระทะ กระทะ กระทะ กระทะ กระทะ กระทะ กระทะ",
              },
              {
                id: "thai-practice-7-3-5",
                name: "แบบฝึกย่อยที่ 7.3.5 เพลง",
                text: "เพลง เพลง เพลง เพลง เพลง เพลง เพลง เพลง เพลง เพลง",
              },
            ],
          },
          {
            id: "thai-session-7-4",
            name: "แบบฝึกหัดที่ 7.4: เพื่อพัฒนา เ ะ -้",
            levels: [
              {
                id: "thai-practice-7-4-1",
                name: "แบบฝึกย่อยที่ 7.4.1 เพลงไพเราะแสนเพราะ",
                text: "เพลงไพเราะแสนเพราะ เวลาเล่นเพลงสากล เพลงหมอลำ ล้ำหน้าไปไกลนะ",
              },
              {
                id: "thai-practice-7-4-2",
                name: "แบบฝึกย่อยที่ 7.4.2 ผลไม้ที่หาทาน",
                text: "ผลไม้ที่หาทานได้มีมะละกอ มะม่วง มะไฟ มะยม และอีกหลาย ๆ อย่าง",
              },
              {
                id: "thai-practice-7-4-3",
                name: "แบบฝึกย่อยที่ 7.4.3 ทหารไทย",
                text: "ทหารไทยบอกว่าทหารไทยมีหน้าที่ปกป้องไม่ให้ห่างหายเพราะหน้าที่",
              },
              {
                id: "thai-practice-7-4-4",
                name: "แบบฝึกย่อยที่ 7.4.4 ลำปางมีแหล่งท่องเที่ยว",
                text: "ลำปางมีแหล่งท่องเที่ยวที่สวยงามมาก ๆ มีพระดี มีม้าพาไปเที่ยว",
              },
              {
                id: "thai-practice-7-4-5",
                name: "แบบฝึกย่อยที่ 7.4.5 วาสนาพาไป",
                text: "วาสนาพาไป ดวงดีไม่มีการแสวงหา อย่าท้อแท้ อย่าเฝ้ารอวาสนามาหา",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-8",
        name: "หน่วยที่ 8: การพิมพ์แป้นอักษร -ิ -ั -ื",
        sessions: [
          {
            id: "thai-session-8-1",
            name: "แบบฝึกหัดที่ 8.1: การพิมพ์แป้นอักษร -ิ -ั -ื",
            levels: [
              {
                id: "thai-practice-8-1-1",
                name: "แบบฝึกย่อยที่ 8.1.1 ดิด",
                text: "ดิด ดิด ดิด ดิด ดิด ดิด ดิด ดิด ดิด ดิด",
              },
              {
                id: "thai-practice-8-1-2",
                name: "แบบฝึกย่อยที่ 8.1.2 ทั่ว",
                text: "ทั่ว ทั่ว ทั่ว ทั่ว ทั่ว ทั่ว ทั่ว ทั่ว ทั่ว ทั่ว",
              },
              {
                id: "thai-practice-8-1-3",
                name: "แบบฝึกย่อยที่ 8.1.3 ทื่อ",
                text: "ทื่อ ทื่อ ทื่อ ทื่อ ทื่อ ทื่อ ทื่อ ทื่อ ทื่อ ทื่อ",
              },
              {
                id: "thai-practice-8-1-4",
                name: "แบบฝึกย่อยที่ 8.1.4 ดิดดิด",
                text: "ดิดดิด ดิดดิด ดิดดิด ดิดดิด ดิดดิด ดิดดิด ดิดดิด ดิดดิด ดิดดิด ดิดดิด",
              },
              {
                id: "thai-practice-8-1-5",
                name: "แบบฝึกย่อยที่ 8.1.5 ดื้อ",
                text: "ดื้อ ดื้อ ดื้อ ดื้อ ดื้อ ดื้อ ดื้อ ดื้อ ดื้อ ดื้อ",
              },
            ],
          },
          {
            id: "thai-session-8-2",
            name: "แบบฝึกหัดที่ 8.2: ทบทวนการพิมพ์แป้นอักษร -ิ -ั -ื",
            levels: [
              {
                id: "thai-practice-8-2-1",
                name: "แบบฝึกย่อยที่ 8.2.1 ดิน",
                text: "ดิน ดิน ดิน ดิน ดิน ดิน ดิน ดิน ดิน ดิน",
              },
              {
                id: "thai-practice-8-2-2",
                name: "แบบฝึกย่อยที่ 8.2.2 กัน",
                text: "กัน กัน กัน กัน กัน กัน กัน กัน กัน กัน",
              },
              {
                id: "thai-practice-8-2-3",
                name: "แบบฝึกย่อยที่ 8.2.3 หืด",
                text: "หืด หืด หืด หืด หืด หืด หืด หืด หืด หืด",
              },
              {
                id: "thai-practice-8-2-4",
                name: "แบบฝึกย่อยที่ 8.2.4 ทั่วไป",
                text: "ทั่วไป ทั่วไป ทั่วไป ทั่วไป ทั่วไป ทั่วไป ทั่วไป ทั่วไป ทั่วไป ทั่วไป",
              },
              {
                id: "thai-practice-8-2-5",
                name: "แบบฝึกย่อยที่ 8.2.5 มือดี",
                text: "มือดี มือดี มือดี มือดี มือดี มือดี มือดี มือดี มือดี มือดี",
              },
            ],
          },
          {
            id: "thai-session-8-3",
            name: "แบบฝึกหัดที่ 8.3: ผสมคำการพิมพ์ -ิ -ั -ื",
            levels: [
              {
                id: "thai-practice-8-3-1",
                name: "แบบฝึกย่อยที่ 8.3.1 วันดี",
                text: "วันดี วันดี วันดี วันดี วันดี วันดี วันดี วันดี วันดี วันดี",
              },
              {
                id: "thai-practice-8-3-2",
                name: "แบบฝึกย่อยที่ 8.3.2 มือดี",
                text: "มือดี มือดี มือดี มือดี มือดี มือดี มือดี มือดี มือดี มือดี",
              },
              {
                id: "thai-practice-8-3-3",
                name: "แบบฝึกย่อยที่ 8.3.3 กินดี",
                text: "กินดี กินดี กินดี กินดี กินดี กินดี กินดี กินดี กินดี กินดี",
              },
              {
                id: "thai-practice-8-3-4",
                name: "แบบฝึกย่อยที่ 8.3.4 สื่อ",
                text: "สื่อ สื่อ สื่อ สื่อ สื่อ สื่อ สื่อ สื่อ สื่อ สื่อ",
              },
              {
                id: "thai-practice-8-3-5",
                name: "แบบฝึกย่อยที่ 8.3.5 มันมือเสือ",
                text: "มันมือเสือ มันมือเสือ มันมือเสือ มันมือเสือ มันมือเสือ มันมือเสือ มันมือเสือ มันมือเสือ มันมือเสือ มันมือเสือ",
              },
            ],
          },
          {
            id: "thai-session-8-4",
            name: "แบบฝึกหัดที่ 8.4: เพื่อพัฒนา -ิ -ั -ื",
            levels: [
              {
                id: "thai-practice-8-4-1",
                name: "แบบฝึกย่อยที่ 8.4.1 วานนี้ดื่มน้ำ",
                text: "วานนี้ดื่มน้ำ น้ำไม่กร่อย ดื่มน้ำแล้วอร่อยดี มีพลัง มีแรงในการวิ่งระยะยาวหลายวา",
              },
              {
                id: "thai-practice-8-4-2",
                name: "แบบฝึกย่อยที่ 8.4.2 ในแม่น้ำปิง",
                text: "ในแม่น้ำปิง แม่น้ำยม ในน้ำมีปลา มีปลาแหวกว่ายในน้ำ หินสวยน้ำใส มาว่ายน้ำด้วยกัน",
              },
              {
                id: "thai-practice-8-4-3",
                name: "แบบฝึกย่อยที่ 8.4.3 เมื่อยามฟ้าใส",
                text: "เมื่อยามฟ้าใสในวันนี้มินิบัสมักวิ่งในเส้นทางที่หวาดเสียว นักเรียนระวังไว้ให้ดี",
              },
              {
                id: "thai-practice-8-4-4",
                name: "แบบฝึกย่อยที่ 8.4.4 ลำปางมีแหล่งท่องเที่ยว",
                text: "ลำปางมีแหล่งท่องเที่ยวที่สวยงามมาก ๆ มีพระดี มีม้าพาไปเที่ยว",
              },
              {
                id: "thai-practice-8-4-5",
                name: "แบบฝึกย่อยที่ 8.4.5 แม้ว่าวันนี้",
                text: "แม้ว่าวันนี้ มีฝนฟ้ามืด หวั่นว่าน้ำมีมาก ทำให้บ้านเรือนเสียหาย ปลายท้องนาเสียหาย",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-9",
        name: "หน่วยที่ 9: การพิมพ์แป้นอักษร ถ ภ -ุ -ื",
        sessions: [
          {
            id: "thai-session-9-1",
            name: "แบบฝึกหัดที่ 9.1: การพิมพ์แป้นอักษร ถ ภ -ุ -ื",
            levels: [
              {
                id: "thai-practice-9-1-1",
                name: "แบบฝึกย่อยที่ 9.1.1 ดถด",
                text: "ดถด ดถด ดถด ดถด ดถด ดถด ดถด ดถด ดถด ดถด",
              },
              {
                id: "thai-practice-9-1-2",
                name: "แบบฝึกย่อยที่ 9.1.2 กภก",
                text: "กภก กภก กภก กภก กภก กภก กภก กภก กภก กภก",
              },
              {
                id: "thai-practice-9-1-3",
                name: "แบบฝึกย่อยที่ 9.1.3 ดุด",
                text: "ดุด ดุด ดุด ดุด ดุด ดุด ดุด ดุด ดุด ดุด",
              },
              {
                id: "thai-practice-9-1-4",
                name: "แบบฝึกย่อยที่ 9.1.4 ดึง",
                text: "ดึง ดึง ดึง ดึง ดึง ดึง ดึง ดึง ดึง ดึง",
              },
              {
                id: "thai-practice-9-1-5",
                name: "แบบฝึกย่อยที่ 9.1.5 ถึง",
                text: "ถึง ถึง ถึง ถึง ถึง ถึง ถึง ถึง ถึง ถึง",
              },
            ],
          },
          {
            id: "thai-session-9-2",
            name: "แบบฝึกหัดที่ 9.2: ทบทวนการพิมพ์แป้นอักษร ถ ภ -ุ -ื",
            levels: [
              {
                id: "thai-practice-9-2-1",
                name: "แบบฝึกย่อยที่ 9.2.1 ถุง",
                text: "ถุง ถุง ถุง ถุง ถุง ถุง ถุง ถุง ถุง ถุง",
              },
              {
                id: "thai-practice-9-2-2",
                name: "แบบฝึกย่อยที่ 9.2.2 ภาพ",
                text: "ภาพ ภาพ ภาพ ภาพ ภาพ ภาพ ภาพ ภาพ ภาพ ภาพ",
              },
              {
                id: "thai-practice-9-2-3",
                name: "แบบฝึกย่อยที่ 9.2.3 ดึงดัน",
                text: "ดึงดัน ดึงดัน ดึงดัน ดึงดัน ดึงดัน ดึงดัน ดึงดัน ดึงดัน ดึงดัน ดึงดัน",
              },
              {
                id: "thai-practice-9-2-4",
                name: "แบบฝึกย่อยที่ 9.2.4 ถ่าย",
                text: "ถ่าย ถ่าย ถ่าย ถ่าย ถ่าย ถ่าย ถ่าย ถ่าย ถ่าย ถ่าย",
              },
              {
                id: "thai-practice-9-2-5",
                name: "แบบฝึกย่อยที่ 9.2.5 ถ้า",
                text: "ถ้า ถ้า ถ้า ถ้า ถ้า ถ้า ถ้า ถ้า ถ้า ถ้า",
              },
            ],
          },
          {
            id: "thai-session-9-3",
            name: "แบบฝึกหัดที่ 9.3: ผสมคำการพิมพ์ ถ ภ -ุ -ื",
            levels: [
              {
                id: "thai-practice-9-3-1",
                name: "แบบฝึกย่อยที่ 9.3.1 ถุงทอง",
                text: "ถุงทอง ถุงทอง ถุงทอง ถุงทอง ถุงทอง ถุงทอง ถุงทอง ถุงทอง ถุงทอง ถุงทอง",
              },
              {
                id: "thai-practice-9-3-2",
                name: "แบบฝึกย่อยที่ 9.3.2 ภายนอก",
                text: "ภายนอก ภายนอก ภายนอก ภายนอก ภายนอก ภายนอก ภายนอก ภายนอก ภายนอก",
              },
              {
                id: "thai-practice-9-3-3",
                name: "แบบฝึกย่อยที่ 9.3.3 ภาพถ่าย",
                text: "ภาพถ่าย ภาพถ่าย ภาพถ่าย ภาพถ่าย ภาพถ่าย ภาพถ่าย ภาพถ่าย ภาพถ่าย ภาพถ่าย ภาพถ่าย",
              },
              {
                id: "thai-practice-9-3-4",
                name: "แบบฝึกย่อยที่ 9.3.4 พุงกาง",
                text: "พุงกาง พุงกาง พุงกาง พุงกาง พุงกาง พุงกาง พุงกาง พุงกาง พุงกาง พุงกาง",
              },
              {
                id: "thai-practice-9-3-5",
                name: "แบบฝึกย่อยที่ 9.3.5 ถึงที่",
                text: "ถึงที่ ถึงที่ ถึงที่ ถึงที่ ถึงที่ ถึงที่ ถึงที่ ถึงที่ ถึงที่ ถึงที่",
              },
            ],
          },
          {
            id: "thai-session-9-4",
            name: "แบบฝึกหัดที่ 9.4: เพื่อพัฒนา ถ ภ -ุ -ื",
            levels: [
              {
                id: "thai-practice-9-4-1",
                name: "แบบฝึกย่อยที่ 9.4.1 ภาพถ่ายที่ได้ถ่ายในเมื่อวานนี้",
                text: "ภาพถ่ายที่ได้ถ่ายในเมื่อวานนี้ มีหลายภาพที่สวยงาม เหมาะสำหรับการนำไปภาพไปเผยแพร่",
              },
              {
                id: "thai-practice-9-4-2",
                name: "แบบฝึกย่อยที่ 9.4.2 วันนี้นั่งเรือไปทุกที่",
                text: "วันนี้นั่งเรือไปทุกที่ที่ถึงสถานที่สวยงามได้ถ่ายภาพไว้มากมาย ทุกท่านน่าไปเที่ยวมาก",
              },
              {
                id: "thai-practice-9-4-3",
                name: "แบบฝึกย่อยที่ 9.4.3 มาถึงสถานที่สำนักงาน",
                text: "มาถึงสถานที่สำนักงานหลายแห่ง มีภาพถ่ายที่สวยงดงาม น่าสะสมไว้ทุกภาพ ภาพดี ๆ หายาก",
              },
              {
                id: "thai-practice-9-4-4",
                name: "แบบฝึกย่อยที่ 9.4.4 ลำปางมีแหล่งท่องเที่ยว",
                text: "มีการหุงหาอาหารกินกัน อย่ามีการฟุ่มเฟือย หากินอย่างประหยัด ไม่ผัดวันประกันพรุ่ง",
              },
              {
                id: "thai-practice-9-4-5",
                name: "แบบฝึกย่อยที่ 9.4.5 ทุกสถานที่มีการถ่ายภาพ",
                text: "ทุกสถานที่มีการถ่ายภาพกันมากมาย หลาย ๆ ภาพมีความสวยงาม สามารถนำไปฝากพี่น้องได้ดี",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-10",
        name: "หน่วยที่ 10: การพิมพ์แป้นอักษร ค ต ข จ ช",
        sessions: [
          {
            id: "thai-session-10-1",
            name: "แบบฝึกหัดที่ 10.1: การพิมพ์แป้นอักษร ค ต ข จ ช",
            levels: [
              {
                id: "thai-practice-10-1-1",
                name: "แบบฝึกย่อยที่ 10.1.1 คามา",
                text: "คามา คามา คามา คามา คามา คามา คามา คามา คามา คามา",
              },
              {
                id: "thai-practice-10-1-2",
                name: "แบบฝึกย่อยที่ 10.1.2 ตนส",
                text: "ตนส ตนส ตนส ตนส ตนส ตนส ตนส ตนส ตนส ตนส",
              },
              {
                id: "thai-practice-10-1-3",
                name: "แบบฝึกย่อยที่ 10.1.3 วขว",
                text: "วขว วขว วขว วขว วขว วขว วขว วขว วขว วขว",
              },
              {
                id: "thai-practice-10-1-4",
                name: "แบบฝึกย่อยที่ 10.1.4 วจว",
                text: "วจว วจว วจว วจว วจว วจว วจว วจว วจว วจว",
              },
              {
                id: "thai-practice-10-1-5",
                name: "แบบฝึกย่อยที่ 10.1.5 วชว",
                text: "วชว วชว วชว วชว วชว วชว วชว วชว วชว วชว",
              },
            ],
          },
          {
            id: "thai-session-10-2",
            name: "แบบฝึกหัดที่ 10.2: ทบทวนการพิมพ์แป้นอักษร ค ต ข จ ช",
            levels: [
              {
                id: "thai-practice-10-2-1",
                name: "แบบฝึกย่อยที่ 10.2.1 ครามา",
                text: "ครามา ครามา ครามา ครามา ครามา ครามา ครามา ครามา ครามา ครามา",
              },
              {
                id: "thai-practice-10-2-2",
                name: "แบบฝึกย่อยที่ 10.2.2 ตนสใส",
                text: "ตนสใส ตนสใส ตนสใส ตนสใส ตนสใส ตนสใส ตนสใส ตนสใส ตนสใส ตนสใส",
              },
              {
                id: "thai-practice-10-2-3",
                name: "แบบฝึกย่อยที่ 10.2.3 จวจจว",
                text: "จวจจว จวจจว จวจจว จวจจว จวจจว จวจจว จวจจว จวจจว จวจจว จวจจว",
              },
              {
                id: "thai-practice-10-2-4",
                name: "แบบฝึกย่อยที่ 10.2.4 ขววด",
                text: "ขววด ขววด ขววด ขววด ขววด ขววด ขววด ขววด ขววด ขววด",
              },
              {
                id: "thai-practice-10-2-5",
                name: "แบบฝึกย่อยที่ 10.2.5 ชววด",
                text: "ชววด ชววด ชววด ชววด ชววด ชววด ชววด ชววด ชววด ชววด",
              },
            ],
          },
          {
            id: "thai-session-10-3",
            name: "แบบฝึกหัดที่ 10.3: ผสมคำการพิมพ์ ค ต ข จ ช",
            levels: [
              {
                id: "thai-practice-10-3-1",
                name: "แบบฝึกย่อยที่ 10.3.1 ความ",
                text: "ความ ความ ความ ความ ความ ความ ความ ความ ความ ความ",
              },
              {
                id: "thai-practice-10-3-2",
                name: "แบบฝึกย่อยที่ 10.3.2 ตรงตาม",
                text: "ตรงตาม ตรงตาม ตรงตาม ตรงตาม ตรงตาม ตรงตาม ตรงตาม ตรงตาม ตรงตาม ตรงตาม",
              },
              {
                id: "thai-practice-10-3-3",
                name: "แบบฝึกย่อยที่ 10.3.3 จาก",
                text: "จาก จาก จาก จาก จาก จาก จาก จาก จาก จาก",
              },
              {
                id: "thai-practice-10-3-4",
                name: "แบบฝึกย่อยที่ 10.3.4 ขวด",
                text: "ขวด ขวด ขวด ขวด ขวด ขวด ขวด ขวด ขวด ขวด",
              },
              {
                id: "thai-practice-10-3-5",
                name: "แบบฝึกย่อยที่ 10.3.5 ช่าง",
                text: "ช่าง ช่าง ช่าง ช่าง ช่าง ช่าง ช่าง ช่าง ช่าง ช่าง",
              },
            ],
          },
          {
            id: "thai-session-10-4",
            name: "แบบฝึกหัดที่ 10.4: เพื่อพัฒนา ค ต ข จ ช",
            levels: [
              {
                id: "thai-practice-10-4-1",
                name: "แบบฝึกย่อยที่ 10.4.1 คนไทยมีความคิดพอเพียง",
                text: "คนไทยมีความคิดพอเพียงในการใช้จ่าย มีการประหยัดตามวิถีความพอเพียง ไม่ขาดการติดตาม",
              },
              {
                id: "thai-practice-10-4-2",
                name: "แบบฝึกย่อยที่ 10.4.2 ความสามารถในการใช้จ่าย",
                text: "ความสามารถในการใช้จ่ายของคนที่มาจากผืนแผ่นดินไกล ๆ มักจะประสบความลำบากที่ขาดแคลน",
              },
              {
                id: "thai-practice-10-4-3",
                name: "แบบฝึกย่อยที่ 10.4.3 การติดต่อกันในสมัยนี้",
                text: "การติดต่อกันในสมัยนี้มีความสะดวกสบายอย่างยิ่ง ไม่ต้องใช้เวลาในการติดต่อถึงกันนาน",
              },
              {
                id: "thai-practice-10-4-4",
                name: "แบบฝึกย่อยที่ 10.4.4 การติดต่อกันในแต่ละภาค",
                text: "การติดต่อกันในแต่ละภาค เมื่อก่อนนั้นมักจะมีความลำบาก แต่ในปัจจุบันนี้มีความสะดวก",
              },
              {
                id: "thai-practice-10-4-5",
                name: "แบบฝึกย่อยที่ 10.4.5 การจะจากกันวันนี้",
                text: "การจะจากกันวันนี้ มีแต่ความยุ่งยาก ต้องค้นหาหนทางในการเชื่อมต่อกันและกันของทุกคน",
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-11",
        name: "หน่วยที่ 11: การคำนวณคำสุทธิ",
        sessions: [
          {
            id: "thai-session-11-1",
            name: "แบบฝึกหัดที่ 11.1: แบบฝึกหัดจับเวลาเพื่อพัฒนาทักษะความเร็วและความแม่นยำ 1 นาที",
            levels: [
              {
                id: "thai-practice-11-1-1",
                name: "แบบฝึกย่อยที่ 11.1.1 ฟ้าสางที่ชายหาด",
                text: "ฟ้าสางที่ชายหาด มองแล้วสวยงามยิ่งนัก ถ้าได้เดินกับคนที่เรารัก จะยิ่งสวยงามมากยิ่งขึ้น ผืนน้ำ ผืนดิน ผืนทราย และน้ำทะเลที่กำลังขึ้นลง ช่างสวยงามจริง ๆ",
                timeLimit: 60,
              },
              {
                id: "thai-practice-11-1-2",
                name: "แบบฝึกย่อยที่ 11.1.2 เมื่อเลิกเรียนแล้ว",
                text: "เมื่อเลิกเรียนแล้ว กลับมาถึงบ้าน ได้พบปะกับพ่อแม่ ได้รับประทานอาหารร่วมกัน ฟังเพลงไพเราะร่วมกัน ช่วยพ่อแม่ทำงานบ้าน และช่วยกันแบ่งเบาภาระของพ่อแม่",
                timeLimit: 60,
              },
              {
                id: "thai-practice-11-1-3",
                name: "แบบฝึกย่อยที่ 11.1.3 เมื่อคืนนี้นอนหลับฝันดี",
                text: "เมื่อคืนนี้นอนหลับฝันดี ฝันว่ามีไก่ออกไข่หลายฟอง แต่ละฟองสวยงามเหมือนทองคำ ราคาน่าจะหลายแสนบาท จึงได้นำเงินไปสร้างบ้านท่ามกลางชุมชนจำนวนมาก",
                timeLimit: 60,
              },
              {
                id: "thai-practice-11-1-4",
                name: "แบบฝึกย่อยที่ 11.1.4 น้ำที่ไหลงลงมาจากป่า",
                text: "น้ำที่ไหลงลงมาจากป่า ทำให้บ้านเรือนและไร่นาเสียหาย เดือดร้อนกันไปทั่ว เพราะสาเหตุที่น่าจะมาจากการตัดไม้ทำลายป่า เราควรที่จะช่วยกันดูแลมิให้ใครมาตัดไม้ได้อีก",
                timeLimit: 60,
              },
              {
                id: "thai-practice-11-1-5",
                name: "แบบฝึกย่อยที่ 11.1.5 ฝนตกไม่ทั่วฟ้า",
                text: "ฝนตกไม่ทั่วฟ้า หมายถึง ได้รับรางวัลหรือสิ่งของไม่ครบถ้วนทุกคน จึงควรที่จะทำการแจกจ่ายให้ครบถ้วนทุกคน หรือแม้แต่การเอาใจใส่พนักงาน ควรที่จะเอาใส่ทุกคนเช่นกัน",
                timeLimit: 60,
              },
            ],
          },
          {
            id: "thai-session-11-2",
            name: "แบบฝึกหัดที่ 11.2:แบบฝึกหัดจับเวลาเพื่อพัฒนาทักษะความเร็วและความแม่นยำ 2 นาที",
            levels: [
              {
                id: "thai-practice-11-2-1",
                name: "แบบฝึกย่อยที่ 11.2.1 การเดินไปข้างหน้า",
                text: "การเดินไปข้างหน้า ทำให้เกิดความหวังในการก้าวเดิน แต่ถ้าต้องถอยหลังเมื่อใด อย่าทำให้ชีวิตต้องถอยหลังตามไปด้วย การเดินทางไปอย่างมีจุดมุ่งหมาย ย่อมทำให้ชีวิตประสบความสำเร็จได้ เราทุกคนจึงต้องลุกขึ้น เพื่อเดินไปข้างหน้าให้ได้ ไปยังจุดหมายที่เราได้วางไว้ และทำให้วันนี้ดีที่สุดเพื่อนำพาชีวิตไปถึงอนาคตที่สดใส",
                timeLimit: 120,
              },
              {
                id: "thai-practice-11-2-2",
                name: "แบบฝึกย่อยที่ 11.2.2 การทำชีวิตให้พอเพียง",
                text: "การทำชีวิตให้พอเพียง ใช้จ่ายไม่ฟุ่มเฟือย ไม่เที่ยวเตร่ หรือหลงใหลในอบายมุข จนทำให้ชีวิตต้องล่มจม ควรหันกลับมามองบ้างว่า ในแต่ละวันที่ผ่านมานั้น ได้ทำอะไรบ้างที่ทำให้ชีวิตดีขึ้น ไม่ว่าจะการอดออม ใช้จ่ายอย่างประหยัด ไม่ฟุ้งเฟื้อและเที่ยวเตร่ มีการวางแผนการใช้จ่ายอย่างรัดกุม ตั้งสติให้มั่นว่า จะทำให้ชีวิตให้ดีขึ้น ทำให้ชีวิตครอบครัวดีขึ้น ร่วมกันสร้างอนาคตอย่างยั่งยืน",
                timeLimit: 120,
              },
              {
                id: "thai-practice-11-2-3",
                name: "แบบฝึกย่อยที่ 11.2.3 มีฝรั่งหรือชาวต่างชาติ",
                text: "มีฝรั่งหรือชาวต่างชาติ ได้เดินทางมาเที่ยวเมืองไทยกันมากขึ้นเรื่อย ๆ ในแต่ละปี ยิ่งในปีนี้ด้วยแล้ว จำนวนชาวต่างชาติเพิ่มมากขึ้นอย่างมากมาย เช่น ชาติทางอเมริกา เยอรมัน อิตาลี ส่วนทางเอเชีย ได้แก่ จีนและเกาหลี ทุกคนล้วนที่จะต้องการมาเที่ยวชมวัดวาอาราม ชายทะเลที่สวยงาม คนไทยที่มีแต่รอยยิ้ม คนไทยจึงควรที่จะให้การต้อนรับชาวต่างชาติให้ดีที่สุด เหมือนกับทุกคนคือเจ้าภาพที่จะต้องต้อนรับแขกที่มาเยือน",
                timeLimit: 120,
              },
              {
                id: "thai-practice-11-2-4",
                name: "แบบฝึกย่อยที่ 11.2.4 การเรียนคือการทำให้คนเรานั้นมีความสามารถ",
                text: "การเรียนคือการทำให้คนเรานั้นมีความสามารถที่จะนำสิ่งที่ได้จากการเรียนไปใช้ในชีวิตประจำวันได้ สามารถที่จะนำพาชีวิตของเราก้าวหน้าไปได้ดีกว่าคนที่ไม่ได้เรียน แม้ว่าอาจจะบ้างที่คนไม่ได้เรียนแล้วมีความก้าวหน้า แต่น้อยคนนักที่จะทำได้เช่นนั้น จะเรียกว่าหนึ่งในล้านย่อมไม่ผิดทางที่ดีที่สุดคือการเรียน เพื่อที่จะได้ไม่ต้องรอคอยความหวังประเภทลม ๆ แล้ง ๆ",
                timeLimit: 120,
              },
              {
                id: "thai-practice-11-2-5",
                name: "แบบฝึกย่อยที่ 11.2.5 เดินทางไปในพื้นที่แห่งหนึ่งในภาคอีสาน",
                text: "เมื่อวานนี้ ผมได้เดินทางไปในพื้นที่แห่งหนึ่งในภาคอีสาน แถวจังหวัดนครราชสีมา มีพื้นที่กว้างขวางมาก มีประชาชนประกอบอาชีพต่าง ๆ มากมาย ทำไร่ ทำนา ทำสวน บางคนกำลังหว่านข้าวในนา บางคนเลี้ยงปลาในสระ บางคนนั่งทอผ้าไหมลายสวย ๆ บางคนขายของ เช่น ขายน้ำมะพร้าว ขายข้าวโพด ขายอ้อย ขายมะม่วง ทำให้เขาเหล่านั้นสามารถสร้างรายได้เลี้ยงครอบครัวได้อย่างดี",
                timeLimit: 120,
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-12",
        name: "หน่วยที่ 12: การพิมพ์แป้นอักษร ณ ศ ฒ ญ ฐ",
        sessions: [
          {
            id: "thai-session-12-1",
            name: "แบบฝึกหัดที่ 12.1: การพิมพ์แป้นอักษร ณ ศ ฒ ญ ฐ",
            levels: [
              {
                id: "thai-practice-12-1-1",
                name: "แบบฝึกย่อยที่ 12.1.1 ราณา",
                text: "ราณา ราณา ราณา ราณา ราณา ราณา ราณา ราณา ราณา ราณา",
              },
              {
                id: "thai-practice-12-1-2",
                name: "แบบฝึกย่อยที่ 12.1.2 ฒารา",
                text: "ฒารา ฒารา ฒารา ฒารา ฒารา ฒารา ฒารา ฒารา ฒารา ฒารา",
              },
              {
                id: "thai-practice-12-1-3",
                name: "แบบฝึกย่อยที่ 12.1.3 ศสส",
                text: "ศสส ศสส ศสส ศสส ศสส ศสส ศสส ศสส ศสส ศสส",
              },
              {
                id: "thai-practice-12-1-4",
                name: "แบบฝึกย่อยที่ 12.1.4 ญวยว",
                text: "ญวยว ญวยว ญวยว ญวยว ญวยว ญวยว ญวยว ญวยว ญวยว ญวยว",
              },
              {
                id: "thai-practice-12-1-5",
                name: "แบบฝึกย่อยที่ 12.1.5 วบวฐ",
                text: "วบวฐ วบวฐ วบวฐ วบวฐ วบวฐ วบวฐ วบวฐ วบวฐ วบวฐ วบวฐ",
              },
            ],
          },
          {
            id: "thai-session-12-2",
            name: "แบบฝึกหัดที่ 12.2 ทบทวนการพิมพ์แป้นอักษร ณ ศ ฒ ญ ฐ",
            levels: [
              {
                id: "thai-practice-12-2-1",
                name: "แบบฝึกย่อยที่ 12.2.1 ราณณา",
                text: "ราณณา ราณณา ราณณา ราณณา ราณณา ราณณา ราณณา ราณณา ราณณา ราณณา",
              },
              {
                id: "thai-practice-12-2-2",
                name: "แบบฝึกย่อยที่ 12.2.2 มาฒา",
                text: "มาฒา มาฒา มาฒา มาฒา มาฒา มาฒา มาฒา มาฒา มาฒา มาฒา",
              },
              {
                id: "thai-practice-12-2-3",
                name: "แบบฝึกย่อยที่ 12.2.3 สศศส",
                text: "สศศส สศศส สศศส สศศส สศศส สศศส สศศส สศศส สศศส สศศส",
              },
              {
                id: "thai-practice-12-2-4",
                name: "แบบฝึกย่อยที่ 12.2.4 ยวญว",
                text: "ยวญว ยวญว ยวญว ยวญว ยวญว ยวญว ยวญว ยวญว ยวญว ยวญว",
              },
              {
                id: "thai-practice-12-2-5",
                name: "แบบฝึกย่อยที่ 12.2.5 บวฐว",
                text: "บวฐว บวฐว บวฐว บวฐว บวฐว บวฐว บวฐว บวฐว บวฐว บวฐว",
              },
            ],
          },
          {
            id: "thai-session-12-3",
            name: "แบบฝึกหัดที่ 12.3: ผสมคำการพิมพ์ ณ ศ ฒ ญ ฐ",
            levels: [
              {
                id: "thai-practice-12-3-1",
                name: "แบบฝึกย่อยที่ 12.3.1 ศาสนา",
                text: "ศาสนา ศาสนา ศาสนา ศาสนา ศาสนา ศาสนา ศาสนา ศาสนา ศาสนา ศาสนา",
              },
              {
                id: "thai-practice-12-3-2",
                name: "แบบฝึกย่อยที่ 12.3.2 หญิง",
                text: "หญิง หญิง หญิง หญิง หญิง หญิง หญิง หญิง หญิง หญิง",
              },
              {
                id: "thai-practice-12-3-3",
                name: "แบบฝึกย่อยที่ 12.3.3 พัฒนา",
                text: "พัฒนา พัฒนา พัฒนา พัฒนา พัฒนา พัฒนา พัฒนา พัฒนา พัฒนา พัฒนา",
              },
              {
                id: "thai-practice-12-3-4",
                name: "แบบฝึกย่อยที่ 12.3.4 เณร",
                text: "เณร เณร เณร เณร เณร เณร เณร เณร เณร เณร",
              },
              {
                id: "thai-practice-12-3-5",
                name: "แบบฝึกย่อยที่ 12.3.5 ฐานะ",
                text: "ฐานะ ฐานะ ฐานะ ฐานะ ฐานะ ฐานะ ฐานะ ฐานะ ฐานะ ฐานะ",
              },
            ],
          },
          {
            id: "thai-session-12-4",
            name: "แบบฝึกหัดที่ 12.4: เพื่อพัฒนา ณ ศ ฒ ญ ฐ",
            levels: [
              {
                id: "thai-practice-12-4-1",
                name: "แบบฝึกย่อยที่ 12.4.1 การพัฒนาประเทศชาติ",
                text: "การพัฒนาประเทศชาติ ทำให้มีความเจริญรุ่งเรือง ประชาชนคนไทยทุกคน จึงควรมีส่วนร่วมในการพัฒนาประเทศร่วมกัน",
                timeLimit: 60,
              },
              {
                id: "thai-practice-12-4-2",
                name: "แบบฝึกย่อยที่ 12.4.2 ศาลอาญาเป็นศาลที่ทำการพิจารณาคดีต่าง ๆ",
                text: "ศาลอาญาเป็นศาลที่ทำการพิจารณาคดีต่าง ๆ คนที่ทำผิดจึงต้องไปที่ศาลอาญา ถ้าทำผิดหลายครั้ง ศาลอาญาจะพิจารณาฐานแห่งความผิดอย่างละเอียดรอบคอบ",
                timeLimit: 60,
              },
              {
                id: "thai-practice-12-4-3",
                name: "แบบฝึกย่อยที่ 12.4.3 หญิงไทยสมัยนี้",
                text: "หญิงไทยสมัยนี้ ไม่ว่าจะมีฐานะอย่างไร มีความน่ารัก เรียบร้อย แต่จะมีความกล้าหาญมากยิ่งขึ้น เพราะหญิงไทยต้องทำมาหากิน หาเลี้ยงครอบครัวด้วย",
                timeLimit: 60,
              },
              {
                id: "thai-practice-12-4-4",
                name: "แบบฝึกย่อยที่ 12.4.4 ปัญหาคุณแม่วัยใส",
                text: "ปัญหาคุณแม่วัยใสที่เรียกชื่อกันในปัจจุบัน เพราะเกิดจากวัยรุ่นที่ไม่ระมัดระวัง เมื่อพลาดแล้ว ปัญหาสังคมจะมีเพิ่มมากขึ้น",
                timeLimit: 60,
              },
              {
                id: "thai-practice-12-4-5",
                name: "แบบฝึกย่อยที่ 12.4.5 การทำคุณงามความดี",
                text: "การทำคุณงามความดี มีคุณค่าอย่างยิ่ง ทุกคนจะสรรเสริญ ชื่นชมในคุณงามความดีนั้น ๆ ไม่ว่าจะมีฐานะอะไร สามารถนำไปใช้กับชีวิตประจำวันได้",
                timeLimit: 60,
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-13",
        name: "หน่วยที่ 13: การพิมพ์แป้นอักษร โ -ู ธ ษ",
        sessions: [
          {
            id: "thai-session-13-1",
            name: "แบบฝึกหัดที่ 13.1: การพิมพ์แป้นอักษร โ -ู ธ ษ",
            levels: [
              {
                id: "thai-practice-13-1-1",
                name: "แบบฝึกย่อยที่ 13.1.1 โดด",
                text: "โดด โดด โดด โดด โดด โดด โดด โดด โดด โดด",
              },
              {
                id: "thai-practice-13-1-2",
                name: "แบบฝึกย่อยที่ 13.1.2 ดูด",
                text: "ดูด ดูด ดูด ดูด ดูด ดูด ดูด ดูด ดูด ดูด",
              },
              {
                id: "thai-practice-13-1-3",
                name: "แบบฝึกย่อยที่ 13.1.3 ดธด",
                text: "ดธด ดธด ดธด ดธด ดธด ดธด ดธด ดธด ดธด ดธด",
              },
              {
                id: "thai-practice-13-1-4",
                name: "แบบฝึกย่อยที่ 13.1.4 ษาษ",
                text: "ษาษ ษาษ ษาษ ษาษ ษาษ ษาษ ษาษ ษาษ ษาษ ษาษ",
              },
              {
                id: "thai-practice-13-1-5",
                name: "แบบฝึกย่อยที่ 13.1.5 ดาษ",
                text: "ดาษ ดาษ ดาษ ดาษ ดาษ ดาษ ดาษ ดาษ ดาษ ดาษ",
              },
            ],
          },
          {
            id: "thai-session-13-2",
            name: "แบบฝึกหัดที่ 13.2 ทบทวนการพิมพ์แป้นอักษร โ -ู ธ ษ",
            levels: [
              {
                id: "thai-practice-13-2-1",
                name: "แบบฝึกย่อยที่ 13.2.1 ดโดโด",
                text: "ดโดโด ดโดโด ดโดโด ดโดโด ดโดโด ดโดโด ดโดโด ดโดโด ดโดโด ดโดโด",
              },
              {
                id: "thai-practice-13-2-2",
                name: "แบบฝึกย่อยที่ 13.2.2 ดุดู",
                text: "ดุดู ดุดู ดุดู ดุดู ดุดู ดุดู ดุดู ดุดู ดุดู ดุดู",
              },
              {
                id: "thai-practice-13-2-3",
                name: "แบบฝึกย่อยที่ 13.2.3 สศศส",
                text: "ดะดธด ดะดธด ดะดธด ดะดธด ดะดธด ดะดธด ดะดธด ดะดธด ดะดธด ดะดธด",
              },
              {
                id: "thai-practice-13-2-4",
                name: "แบบฝึกย่อยที่ 13.2.4 ดาษา",
                text: "ดาษา ดาษา ดาษา ดาษา ดาษา ดาษา ดาษา ดาษา ดาษา ดาษา",
              },
              {
                id: "thai-practice-13-2-5",
                name: "แบบฝึกย่อยที่ 13.2.5 โดดดูดี",
                text: "โดดดูดี โดดดูดี โดดดูดี โดดดูดี โดดดูดี โดดดูดี โดดดูดี โดดดูดี โดดดูดี โดดดูดี",
              },
            ],
          },
          {
            id: "thai-session-13-3",
            name: "แบบฝึกหัดที่ 13.3: ผสมคำการพิมพ์ โ -ู ธ ษ",
            levels: [
              {
                id: "thai-practice-13-3-1",
                name: "แบบฝึกย่อยที่ 13.3.1 กระโดด",
                text: "กระโดด กระโดด กระโดด กระโดด กระโดด กระโดด กระโดด กระโดด กระโดด กระโดด",
              },
              {
                id: "thai-practice-13-3-2",
                name: "แบบฝึกย่อยที่ 13.3.2 ถูกดูด",
                text: "ถูกดูด ถูกดูด ถูกดูด ถูกดูด ถูกดูด ถูกดูด ถูกดูด ถูกดูด ถูกดูด ถูกดูด",
              },
              {
                id: "thai-practice-13-3-3",
                name: "แบบฝึกย่อยที่ 13.3.3 กระดาษ",
                text: "กระดาษ กระดาษ กระดาษ กระดาษ กระดาษ กระดาษ กระดาษ กระดาษ กระดาษ กระดาษ",
              },
              {
                id: "thai-practice-13-3-4",
                name: "แบบฝึกย่อยที่ 13.3.4 ธนาคาร",
                text: "ธนาคาร ธนาคาร ธนาคาร ธนาคาร ธนาคาร ธนาคาร ธนาคาร ธนาคาร ธนาคาร ธนาคาร",
              },
              {
                id: "thai-practice-13-3-5",
                name: "แบบฝึกย่อยที่ 13.3.5 มโนธรรม",
                text: "มโนธรรม มโนธรรม มโนธรรม มโนธรรม มโนธรรม มโนธรรม มโนธรรม มโนธรรม มโนธรรม มโนธรรม",
              },
            ],
          },
          {
            id: "thai-session-13-4",
            name: "แบบฝึกหัดที่ 13.4: เพื่อพัฒนา โ -ู ธ ษ",
            levels: [
              {
                id: "thai-practice-13-4-1",
                name: "แบบฝึกย่อยที่ 13.4.1 การกระทำใด ๆ",
                text: "การกระทำใด ๆ โดยปราศจากความนึกคิด ไม่มีคุณธรรมประจำใจ ย่อมทำให้เกิดความเสื่อมเสีย ถูกผู้คนดูถูกและประณามหยามเหยียด",
                timeLimit: 60,
              },
              {
                id: "thai-practice-13-4-2",
                name: "แบบฝึกย่อยที่ 13.4.2 การที่หญิงสาวโดนถูกกระทำมิดีมิร้าย",
                text: "การที่หญิงสาวโดนถูกกระทำมิดีมิร้าย ผู้ที่กระทำย่อมมีบทลงโทษอย่างหนัก เพื่อมิให้ผู้ใดกระทำอีก เพื่อป้องกันมิให้หญิงสาวถูกโดนทำร้ายอีก",
                timeLimit: 60,
              },
              {
                id: "thai-practice-13-4-3",
                name: "แบบฝึกย่อยที่ 13.4.3 ศาสนาทุกศาสนาสอนให้คนทำแต่ความดี",
                text: "ศาสนาทุกศาสนาสอนให้คนทำแต่ความดี ไม่มีศาสนาใดที่สอนให้ผู้คนทำแต่ความชั่ว ไม่ว่าจะนับถือศาสนาใด ๆ จงทำแต่ความดี ยึดมั่นถือมั่นในความดี",
                timeLimit: 60,
              },
              {
                id: "thai-practice-13-4-4",
                name: "แบบฝึกย่อยที่ 13.4.4 การที่จะทำการออมเงินให้ได้มาก ๆ",
                text: "การที่จะทำการออมเงินให้ได้มาก ๆ นอกจากจะไม่ใช้จ่ายอย่างฟุ่มเฟือยแล้ว ควรที่จะออมเงินไว้กับธนาคาร ตามหลักปรัชญาเศรษฐกิจพอเพียง",
                timeLimit: 60,
              },
              {
                id: "thai-practice-13-4-5",
                name: "แบบฝึกย่อยที่ 13.4.5 ธงชาติไทย",
                text: "ธงชาติไทยได้ถูกเปลี่ยนแปลงและพัฒนามาหลายยุคหลายสมัย จนกระทั่งมีธงชาติไทยที่มีสามสีในปัจจุบัน สีแดงหมายถึงชาติ สีขาวหมายถึงศาสนา สีน้ำเงินหมายถึงพระเจ้าแผ่นดิน",
                timeLimit: 60,
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-14",
        name: "หน่วยที่ 14: การพิมพ์แป้นอักษร ฉ ฏ ฎ ซ",
        sessions: [
          {
            id: "thai-session-14-1",
            name: "แบบฝึกหัดที่ 14.1: การพิมพ์แป้นอักษร ฉ ฏ ฎ ซ",
            levels: [
              {
                id: "thai-practice-14-1-1",
                name: "แบบฝึกย่อยที่ 14.1.1 กฉก",
                text: "กฉก กฉก กฉก กฉก กฉก กฉก กฉก กฉก กฉก กฉก",
              },
              {
                id: "thai-practice-14-1-2",
                name: "แบบฝึกย่อยที่ 14.1.2 กฏก",
                text: "กฏก กฏก กฏก กฏก กฏก กฏก กฏก กฏก กฏก กฏก",
              },
              {
                id: "thai-practice-14-1-3",
                name: "แบบฝึกย่อยที่ 14.1.3 กฎก",
                text: "กฎก กฎก กฎก กฎก กฎก กฎก กฎก กฎก กฎก กฎก",
              },
              {
                id: "thai-practice-14-1-4",
                name: "แบบฝึกย่อยที่ 14.1.4 วซว",
                text: "วซว วซว วซว วซว วซว วซว วซว วซว วซว วซว",
              },
              {
                id: "thai-practice-14-1-5",
                name: "แบบฝึกย่อยที่ 14.1.5 วซซว",
                text: "วซซว วซซว วซซว วซซว วซซว วซซว วซซว วซซว วซซว วซซว",
              },
            ],
          },
          {
            id: "thai-session-14-2",
            name: "แบบฝึกหัดที่ 14.2 ทบทวนการพิมพ์แป้นอักษร ฉ ฏ ฎ ซ",
            levels: [
              {
                id: "thai-practice-14-2-1",
                name: "แบบฝึกย่อยที่ 14.2.1 กแกฉก",
                text: "กแกฉก กแกฉก กแกฉก กแกฉก กแกฉก กแกฉก กแกฉก กแกฉก กแกฉก กแกฉก",
              },
              {
                id: "thai-practice-14-2-2",
                name: "แบบฝึกย่อยที่ 14.2.2 กฏฏก",
                text: "กฏฏก กฏฏก กฏฏก กฏฏก กฏฏก กฏฏก กฏฏก กฏฏก กฏฏก กฏฏก",
              },
              {
                id: "thai-practice-14-2-3",
                name: "แบบฝึกย่อยที่ 14.2.3 กำกฎก",
                text: "กำกฎก กำกฎก กำกฎก กำกฎก กำกฎก กำกฎก กำกฎก กำกฎก กำกฎก กำกฎก",
              },
              {
                id: "thai-practice-14-2-4",
                name: "แบบฝึกย่อยที่ 14.2.4 ซซวว",
                text: "ซซวว ซซวว ซซวว ซซวว ซซวว ซซวว ซซวว ซซวว ซซวว ซซวว",
              },
              {
                id: "thai-practice-14-2-5",
                name: "แบบฝึกย่อยที่ 14.2.5 ซาว",
                text: "ซาว ซาว ซาว ซาว ซาว ซาว ซาว ซาว ซาว ซาว",
              },
            ],
          },
          {
            id: "thai-session-14-3",
            name: "แบบฝึกหัดที่ 14.3: ผสมคำการพิมพ์ ฉ ฏ ฎ ซ",
            levels: [
              {
                id: "thai-practice-14-3-1",
                name: "แบบฝึกย่อยที่ 14.3.1 ฉัน",
                text: "ฉัน ฉัน ฉัน ฉัน ฉัน ฉัน ฉัน ฉัน ฉัน ฉัน",
              },
              {
                id: "thai-practice-14-3-2",
                name: "แบบฝึกย่อยที่ 14.3.2 ปฏิบัติ",
                text: "ปฏิบัติ ปฏิบัติ ปฏิบัติ ปฏิบัติ ปฏิบัติ ปฏิบัติ ปฏิบัติ ปฏิบัติ ปฏิบัติ ปฏิบัติ",
              },
              {
                id: "thai-practice-14-3-3",
                name: "แบบฝึกย่อยที่ 14.3.3 ตามกฎ",
                text: "ตามกฎ ตามกฎ ตามกฎ ตามกฎ ตามกฎ ตามกฎ ตามกฎ ตามกฎ ตามกฎ ตามกฎ",
              },
              {
                id: "thai-practice-14-3-4",
                name: "แบบฝึกย่อยที่ 14.3.4 ซาบซึ่ง",
                text: "ซาบซึ่ง ซาบซึ่ง ซาบซึ่ง ซาบซึ่ง ซาบซึ่ง ซาบซึ่ง ซาบซึ่ง ซาบซึ่ง ซาบซึ่ง ซาบซึ่ง",
              },
              {
                id: "thai-practice-14-3-5",
                name: "แบบฝึกย่อยที่ 14.3.5 ฉะนั้น",
                text: "ฉะนั้น ฉะนั้น ฉะนั้น ฉะนั้น ฉะนั้น ฉะนั้น ฉะนั้น ฉะนั้น ฉะนั้น ฉะนั้น",
              },
            ],
          },
          {
            id: "thai-session-14-4",
            name: "แบบฝึกหัดที่ 14.4: เพื่อพัฒนา ฉ ฏ ฎ ซ",
            levels: [
              {
                id: "thai-practice-14-4-1",
                name: "แบบฝึกย่อยที่ 14.4.1 เดินทางไปปฏิบัติธรรม",
                text: "ฉันมีความสุขทุกครั้งที่ได้เดินทางไปปฏิบัติธรรมตามวัดวาอารามต่าง ๆ เพราะการที่ได้ปฏิบัติธรรมนั้น ทำให้คนเรามีความสุข ไม่ปฏิบัติใด ๆ แบบฉาบฉวย",
                timeLimit: 60,
              },
              {
                id: "thai-practice-14-4-2",
                name: "แบบฝึกย่อยที่ 14.4.2 กฎที่สถานศึกษา",
                text: "กฎที่สถานศึกษากำหนดให้ปฏิบัตินั้น นักศึกษาควรที่จะปฏิบัติตาม เพื่อให้ทุกคนอยู่ร่วมกันด้วยความเรียบร้อย ซึ่งไม่น่าจะมีปัญหาอะไร",
                timeLimit: 60,
              },
              {
                id: "thai-practice-14-4-3",
                name: "แบบฝึกย่อยที่ 14.4.3 พระมหากรุณาธิคุณของในหลวง",
                text: "คนไทยมีความซาบซึ้งในพระมหากรุณาธิคุณของในหลวง ที่ได้ทรงดูแลความเป็นอยู่ของปวงชนชาวไทยมาตลอดเวลา ซึ่งคนไทยได้ปฏิบัติตามรอยเท้าพ่อมาตลอด",
                timeLimit: 60,
              },
              {
                id: "thai-practice-14-4-4",
                name: "แบบฝึกย่อยที่ 14.4.4 การปฏิรูปทางการศึกษา",
                text: "การปฏิรูปทางการศึกษาได้ก้าวหน้าไปอย่างมาก ซึ่งจะทำให้การศึกษาของประเทศมีคุณภาพมากยิ่งขึ้น ฉะนั้น นักศึกษาและนักเรียนจะได้พัฒนาตนเองไปสู่เป้าหมาย",
                timeLimit: 60,
              },
              {
                id: "thai-practice-14-4-5",
                name: "แบบฝึกย่อยที่ 14.4.5 ตามหนังสือที่อ้างถึง",
                text: "ตามหนังสือที่อ้างถึง กระทรวงศึกษาธิการได้ออกกฎระเบียบต่าง ๆ เพื่อให้ผู้ที่เกี่ยวข้องได้นำไปปฏิบัติ ซึ่งในขณะนี้ ทุกคนได้รับทราบเกี่ยวกับกฎที่ออกมาเพื่อนำไปปฏิบัติแล้ว",
                timeLimit: 60,
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-15",
        name: "หน่วยที่ 15: การพิมพ์แป้นอักษร -็ ฬ ฑ ฮ ฆ",
        sessions: [
          {
            id: "thai-session-15-1",
            name: "แบบฝึกหัดที่ 15.1: การพิมพ์แป้นอักษร -็ ฬ ฑ ฮ ฆ",
            levels: [
              {
                id: "thai-practice-15-1-1",
                name: "แบบฝึกย่อยที่ 15.1.1 ท้ท็",
                text: "ท้ท็ ท้ท็ ท้ท็ ท้ท็ ท้ท็ ท้ท็ ท้ท็ ท้ท็ ท้ท็ ท้ท็",
              },
              {
                id: "thai-practice-15-1-2",
                name: "แบบฝึกย่อยที่ 15.1.2 สฬส",
                text: "สฬส สฬส สฬส สฬส สฬส สฬส สฬส สฬส สฬส สฬส",
              },
              {
                id: "thai-practice-15-1-3",
                name: "แบบฝึกย่อยที่ 15.1.3 ดฑด",
                text: "ดฑด ดฑด ดฑด ดฑด ดฑด ดฑด ดฑด ดฑด ดฑด ดฑด",
              },
              {
                id: "thai-practice-15-1-4",
                name: "แบบฝึกย่อยที่ 15.1.4 ดฮด",
                text: "ดฮด ดฮด ดฮด ดฮด ดฮด ดฮด ดฮด ดฮด ดฮด ดฮด",
              },
              {
                id: "thai-practice-15-1-5",
                name: "แบบฝึกย่อยที่ 15.1.5 หฆห",
                text: "หฆห หฆห หฆห หฆห หฆห หฆห หฆห หฆห หฆห หฆห",
              },
            ],
          },
          {
            id: "thai-session-15-2",
            name: "แบบฝึกหัดที่ 15.2 ทบทวนการพิมพ์แป้นอักษร -็ ฬ ฑ ฮ ฆ",
            levels: [
              {
                id: "thai-practice-15-2-1",
                name: "แบบฝึกย่อยที่ 15.2.1 ท้าท็",
                text: "ท้าท็ ท้าท็ ท้าท็ ท้าท็ ท้าท็ ท้าท็ ท้าท็ ท้าท็ ท้าท็ ท้าท็",
              },
              {
                id: "thai-practice-15-2-2",
                name: "แบบฝึกย่อยที่ 15.2.2 ดพดฑด",
                text: "ดพดฑด ดพดฑด ดพดฑด ดพดฑด ดพดฑด ดพดฑด ดพดฑด ดพดฑด ดพดฑด ดพดฑด",
              },
              {
                id: "thai-practice-15-2-3",
                name: "แบบฝึกย่อยที่ 15.2.3 สใสฬส",
                text: "สใสฬส สใสฬส สใสฬส สใสฬส สใสฬส สใสฬส สใสฬส สใสฬส สใสฬส สใสฬส",
              },
              {
                id: "thai-practice-15-2-4",
                name: "แบบฝึกย่อยที่ 15.2.4 ดอดฮด",
                text: "ดอดฮด ดอดฮด ดอดฮด ดอดฮด ดอดฮด ดอดฮด ดอดฮด ดอดฮด ดอดฮด ดอดฮด",
              },
              {
                id: "thai-practice-15-2-5",
                name: "แบบฝึกย่อยที่ 15.2.5 หหฆหห",
                text: "หหฆหห หหฆหห หหฆหห หหฆหห หหฆหห หหฆหห หหฆหห หหฆหห หหฆหห หหฆหห",
              },
            ],
          },
          {
            id: "thai-session-15-3",
            name: "แบบฝึกหัดที่ 15.3: ผสมคำการพิมพ์ -็ ฬ ฑ ฮ ฆ",
            levels: [
              {
                id: "thai-practice-15-3-1",
                name: "แบบฝึกย่อยที่ 15.3.1 เป็น",
                text: "เป็น เป็น เป็น เป็น เป็น เป็น เป็น เป็น เป็น เป็น",
              },
              {
                id: "thai-practice-15-3-2",
                name: "แบบฝึกย่อยที่ 15.3.2 จัณฑาล",
                text: "จัณฑาล จัณฑาล จัณฑาล จัณฑาล จัณฑาล จัณฑาล จัณฑาล จัณฑาล จัณฑาล จัณฑาล",
              },
              {
                id: "thai-practice-15-3-3",
                name: "แบบฝึกย่อยที่ 15.3.3 จุฬา",
                text: "จุฬา จุฬา จุฬา จุฬา จุฬา จุฬา จุฬา จุฬา จุฬา จุฬา",
              },
              {
                id: "thai-practice-15-3-4",
                name: "แบบฝึกย่อยที่ 15.3.4 เฮฮา",
                text: "เฮฮา เฮฮา เฮฮา เฮฮา เฮฮา เฮฮา เฮฮา เฮฮา เฮฮา เฮฮา",
              },
              {
                id: "thai-practice-15-3-5",
                name: "แบบฝึกย่อยที่ 15.3.5 ระฆัง",
                text: "ระฆัง ระฆัง ระฆัง ระฆัง ระฆัง ระฆัง ระฆัง ระฆัง ระฆัง ระฆัง",
              },
            ],
          },
          {
            id: "thai-session-15-4",
            name: "แบบฝึกหัดที่ 15.4: เพื่อพัฒนา -็ ฬ ฑ ฮ ฆ",
            levels: [
              {
                id: "thai-practice-15-4-1",
                name: "แบบฝึกย่อยที่ 15.4.1 ระฆังดังขึ้นในโรงเรียนเล็ก ๆ",
                text: "ระฆังดังขึ้นในโรงเรียนเล็ก ๆ ท่ามกลางป่าเขาลำเนาไพร เด็ก ๆ กำลังเล่นกีฬากันอย่างสนุกสนานเฮฮา เช่น ตะกร้อ ฟุตซอล แบดมินตัน เป็นต้น",
                timeLimit: 60,
              },
              {
                id: "thai-practice-15-4-2",
                name: "แบบฝึกย่อยที่ 15.4.2 ชนชั้นของประเทศอินเดีย",
                text: "ชนชั้นของประเทศอินเดีย แบ่งออกเป็นหลายวรรณะด้วยกัน โดยวรรณะจัณฑาลเป็นวรรณะที่ต่ำสุด มีความยากจนและมีอยู่เป็นจำนวนมากของประเทศ",
                timeLimit: 60,
              },
              {
                id: "thai-practice-15-4-3",
                name: "แบบฝึกย่อยที่ 15.4.3 ว่าวจุฬากับว่าวปักเป้า",
                text: "ว่าวจุฬากับว่าวปักเป้า เป็นว่าวที่นิยมเล่นกันมาอย่างยาวนาน ที่ไหนมีว่าวจุฬา ก็มักจะมีว่าปักเป้าอยู่ด้วยเช่นกัน นับว่าเป็นกีฬาอีกอย่างหนึ่งที่นิยมเล่นกัน",
                timeLimit: 60,
              },
              {
                id: "thai-practice-15-4-4",
                name: "แบบฝึกย่อยที่ 15.4.4 ฆราวาสธรรม",
                text: "ฆราวาสธรรม เป็นธรรมที่นำมาซึ่งความสุข ความเจริญ และความสงบเย็นแก่ผู้ปฏิบัติตามเป็นธรรมที่จะนำพาครอบครัวให้อยู่เย็นเป็นสุข นำพาให้ชีวิตการครองเรือนเป็นไปด้วยความราบรื่น",
                timeLimit: 60,
              },
              {
                id: "thai-practice-15-4-5",
                name: "แบบฝึกย่อยที่ 15.4.5 การล่าปลาวาฬ",
                text: "การล่าปลาวาฬ บางประเทศถือว่าเป็นกีฬาชนิดหนึ่ง ซึ่งมักจะถูกต่อต้านจากประเทศต่าง ๆ เพราะเป็นกีฬาที่ทารุณ และอาจจะทำให้ปริมาณของปลาวาฬลดลง",
                timeLimit: 60,
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-16",
        name: "หน่วยที่ 16: การพิมพ์แป้นอักษร -์ -๋ -๊ ฯ ฌ",
        sessions: [
          {
            id: "thai-session-16-1",
            name: "แบบฝึกหัดที่ 16.1: การพิมพ์แป้นอักษร -์ -๋ -๊ ฯ ฌ",
            levels: [
              {
                id: "thai-practice-16-1-1",
                name: "แบบฝึกย่อยที่ 16.1.1 ทืท์",
                text: "ทืท์ ทืท์ ทืท์ ทืท์ ทืท์ ทืท์ ทืท์ ทืท์ ทืท์ ทืท์",
              },
              {
                id: "thai-practice-16-1-2",
                name: "แบบฝึกย่อยที่ 16.1.2 จ่าจ๋า",
                text: "จ่าจ๋า จ่าจ๋า จ่าจ๋า จ่าจ๋า จ่าจ๋า จ่าจ๋า จ่าจ๋า จ่าจ๋า จ่าจ๋า จ่าจ๋า",
              },
              {
                id: "thai-practice-16-1-3",
                name: "แบบฝึกย่อยที่ 16.1.3 สีส๊",
                text: "สีส๊ สีส๊ สีส๊ สีส๊ สีส๊ สีส๊ สีส๊ สีส๊ สีส๊ สีส๊",
              },
              {
                id: "thai-practice-16-1-4",
                name: "แบบฝึกย่อยที่ 16.1.4 สนฯส ",
                text: "สนฯส สนฯส สนฯส สนฯส สนฯส สนฯส สนฯส สนฯส สนฯส สนฯส",
              },
              {
                id: "thai-practice-16-1-5",
                name: "แบบฝึกย่อยที่ 16.1.5 ดเดฌ",
                text: "ดเดฌ ดเดฌ ดเดฌ ดเดฌ ดเดฌ ดเดฌ ดเดฌ ดเดฌ ดเดฌ ดเดฌ",
              },
            ],
          },
          {
            id: "thai-session-16-2",
            name: "แบบฝึกหัดที่ 16.2 ทบทวนการพิมพ์แป้นอักษร -์ -๋ -๊ ฯ ฌ",
            levels: [
              {
                id: "thai-practice-16-2-1",
                name: "แบบฝึกย่อยที่ 16.2.1 ทท์ท",
                text: "ทท์ท ทท์ท ทท์ท ทท์ท ทท์ท ทท์ท ทท์ท ทท์ท ทท์ท ทท์ท",
              },
              {
                id: "thai-practice-16-2-2",
                name: "แบบฝึกย่อยที่ 16.2.2 ววาว๋",
                text: "ววาว๋ ววาว๋ ววาว๋ ววาว๋ ววาว๋ ววาว๋ ววาว๋ ววาว๋ ววาว๋ ววาว๋",
              },
              {
                id: "thai-practice-16-2-3",
                name: "แบบฝึกย่อยที่ 16.2.3 ววาว๊",
                text: "ววาว๊ ววาว๊ ววาว๊ ววาว๊ ววาว๊ ววาว๊ ววาว๊ ววาว๊ ววาว๊ ววาว๊",
              },
              {
                id: "thai-practice-16-2-4",
                name: "แบบฝึกย่อยที่ 16.2.4 สนสฯ",
                text: "สนสฯ สนสฯ สนสฯ สนสฯ สนสฯ สนสฯ สนสฯ สนสฯ สนสฯ สนสฯ",
              },
              {
                id: "thai-practice-16-2-5",
                name: "แบบฝึกย่อยที่ 16.2.5 ฌดเด",
                text: "ฌดเด ฌดเด ฌดเด ฌดเด ฌดเด ฌดเด ฌดเด ฌดเด ฌดเด ฌดเด",
              },
            ],
          },
          {
            id: "thai-session-16-3",
            name: "แบบฝึกหัดที่ 16.3: ผสมคำการพิมพ์ -์ -๋ -๊ ฯ ฌ",
            levels: [
              {
                id: "thai-practice-16-3-1",
                name: "แบบฝึกย่อยที่ 16.3.1 เกณฑ์",
                text: "เกณฑ์ เกณฑ์ เกณฑ์ เกณฑ์ เกณฑ์ เกณฑ์ เกณฑ์ เกณฑ์ เกณฑ์ เกณฑ์",
              },
              {
                id: "thai-practice-16-3-2",
                name: "แบบฝึกย่อยที่ 16.3.2 เก๋า",
                text: "เก๋า เก๋า เก๋า เก๋า เก๋า เก๋า เก๋า เก๋า เก๋า เก๋า",
              },
              {
                id: "thai-practice-16-3-3",
                name: "แบบฝึกย่อยที่ 16.3.3 จุฬา",
                text: "เจ๊ง เจ๊ง เจ๊ง เจ๊ง เจ๊ง เจ๊ง เจ๊ง เจ๊ง เจ๊ง เจ๊ง",
              },
              {
                id: "thai-practice-16-3-4",
                name: "แบบฝึกย่อยที่ 16.3.4 เฮฮา",
                text: "ฯลฯ ฯลฯ ฯลฯ ฯลฯ ฯลฯ ฯลฯ ฯลฯ ฯลฯ ฯลฯ ฯลฯ",
              },
              {
                id: "thai-practice-16-3-5",
                name: "แบบฝึกย่อยที่ 16.3.5 เฌอ",
                text: "เฌอ เฌอ เฌอ เฌอ เฌอ เฌอ เฌอ เฌอ เฌอ เฌอ",
              },
            ],
          },
          {
            id: "thai-session-16-4",
            name: "แบบฝึกหัดที่ 16.4: เพื่อพัฒนา -์ -๋ -๊ ฯ ฌ",
            levels: [
              {
                id: "thai-practice-16-4-1",
                name: "แบบฝึกย่อยที่ 16.4.1 ระฆังดังขึ้นในโรงเรียนเล็ก ๆ",
                text: "การเกณฑ์ทหาร เป็นกฎเกณฑ์ที่จะต้องกระทำสำหรับชายไทยที่มีอายุครบการเกณฑ์ทหาร ซึ่งจะต้องเข้าทำการคัดเลือกเพื่อเป็นทหารเกณฑ์ ซึ่งแต่ละปีจะมีอยู่สองครั้งด้วยกัน",
                timeLimit: 60,
              },
              {
                id: "thai-practice-16-4-2",
                name: "แบบฝึกย่อยที่ 16.4.2 ชนชั้นของประเทศอินเดีย",
                text: "การพูดหรือการสนทนา มักมีหลาย ๆ คำที่ใช้กันบ่อย ๆ เช่น จ้า จ๋า จ๊ะ นะจ๊ะ จุ๊บจุ๊บ ฯลฯ ซึ่งคำเหล่านี้ มักจะใช้กับคู่สนทนาในกลุ่มวัยรุ่น โดยเฉพาะในโลกอินเทอร์เน็ต",
                timeLimit: 60,
              },
              {
                id: "thai-practice-16-4-3",
                name: "แบบฝึกย่อยที่ 16.4.3 ว่าวจุฬากับว่าวปักเป้า",
                text: "วันนี้ฟุตบอลไทยเล่นได้เจ๋งมาก ถ้ามีการประชาสัมพันธ์ให้ดีกว่านี้ ก็จะมีผู้ที่เข้ามาชมมากยิ่งขึ้น โดยเฉพาะองค์การที่ชื่อสมาคมฟุตบอลแห่งประเทศไทย",
                timeLimit: 60,
              },
              {
                id: "thai-practice-16-4-4",
                name: "แบบฝึกย่อยที่ 16.4.4 ฆราวาสธรรม",
                text: "การจัดตั้งองค์การนักวิชาชีพในอนาคตแห่งประเทศไทย จะช่วยฝึกฝนให้เยาวชนที่เรียนในสายอาชีวศึกษา ได้ใช้องค์ความรู้และทักษะวิชาชีพอย่างเต็มที่",
                timeLimit: 60,
              },
              {
                id: "thai-practice-16-4-5",
                name: "แบบฝึกย่อยที่ 16.4.5 การล่าปลาวาฬ",
                text: "กิจกรรมการรับขวัญน้องใหม่ฯ เป็นปัญหาเกิดขึ้นทุกปี ในปีนี้กระทรวงศึกษาธิการจึงได้ขอให้ระงับการจัดกิจกรรมดังกล่าว เพื่อป้องกันปัญหาที่อาจจะเกิดขึ้น",
                timeLimit: 60,
              },
            ],
          },
        ],
      },
      {
        id: "thai-unit-17",
        name: "หน่วยที่ 17: การพิมพ์เพื่อพัฒนาทักษะความเร็วและความแม่นยำ",
        sessions: [
          {
            id: "thai-session-17-1",
            name: "แบบฝึกหัดที่ 17.1: แบบฝึกหัดการพิมพ์จับเวลา 1 นาที",
            levels: [
              {
                id: "thai-practice-17-1-1",
                name: "แบบฝึกย่อยที่ 17.1.1 พระพุทธเจ้าตรัส",
                text: "พระพุทธเจ้าตรัสทุกคำเป็นคำจริงหมด ไม่มีเล่น ทุกอย่างเมื่อได้มาแล้วก็ย่อมต้องสูญเสียในที่สุด คนส่วนใหญ่เคยสูญเสียมากันทั้งนั้น ไม่ว่าจะเป็นโภคทรัพย์ไปจนถึงชีวิต",
                timeLimit: 60,
              },
              {
                id: "thai-practice-17-1-2",
                name: "แบบฝึกย่อยที่ 17.1.2 จริยธรรม",
                text: "จริยธรรม หมายถึง การนำความดีงามภายในจิตใจ นำการรู้กฎธรรมชาติในหลักธรรมคำสอนมาประพฤติปฏิบัติให้เกิดประโยชน์ในการดำเนินชีวิต",
                timeLimit: 60,
              },
              {
                id: "thai-practice-17-1-3",
                name: "แบบฝึกย่อยที่ 17.1.3 สังคมไทยยังขาดคนกล้าที่จะตัดสินใจ",
                text: "สังคมไทยยังขาดคนกล้าที่จะตัดสินใจ หรือกล้าที่จะยื่นมือเข้าไปช่วยเหลือผู้อื่น หากไม่จำเป็นหรืออาจเห็นว่าเป็นเรื่องปกติธรรมดา จึงอยากเชิญชวนให้ผู้คนในสังคมได้หันมาช่วยกันทำความดี",
                timeLimit: 30,
              },
              {
                id: "thai-practice-17-1-4",
                name: "แบบฝึกย่อยที่ 17.1.4 ความงามของธรรมชาติริมแม่น้ำกระบี่",
                text: "ความหลงใหลในความงามของธรรมชาติริมแม่น้ำกระบี่ในจังหวัดกระบี่ของสองสามีภรรยาชาวนอร์เวย์และชาวจีนคู่นี้ เกือบจบลงด้วยโศกนาฏกรรม นายชัย อุบลจินดา ได้พยายามทุกอย่างเพื่อช่วยเหลือนักท่องเที่ยวจนกลายเป็นวีรบุรุษ",
                timeLimit: 60,
              },
              {
                id: "thai-practice-17-1-5",
                name: "แบบฝึกย่อยที่ 17.1.5 ช่วยเหลือผู้เดือดร้อนโดยไม่หวังสิ่งตอบแทน",
                text: "การแสดงน้ำใจช่วยเหลือผู้เดือดร้อนโดยไม่หวังสิ่งตอบแทน ทำให้ชัชกลายเป็นแรงบันดาลใจ และสร้างความหวังให้คนในสังคมที่กำลังโหยหาคนที่พร้อมจะเสียสละเพื่อคนอื่น สถานการณ์มักเปลี่ยนชีวิตของคนเสมอ",
                timeLimit: 60,
              },
            ],
          },
          {
            id: "thai-session-17-2",
            name: "แบบฝึกหัดที่ 17.2 แบบฝึกการพิมพ์จับเวลา 2 นาที",
            levels: [
              {
                id: "thai-practice-17-2-1",
                name: "แบบฝึกย่อยที่ 17.2.1 การดำรงชีวิตประจำวัน",
                text: "การดำรงชีวิตประจำวัน การปฏิบัติงานต่าง ๆ จะได้รับผลสำเร็จจำเป็นต้องอาศัยคุณธรรม จริยธรรม หลายประการมาประกอบในการปฏิบัติงาน เช่น ความซื่อสัตย์ต่อตนเอง ซึ่งสัตย์ต่อสังคม ทำสิ่งที่เกิดประโยชน์และศีลธรรม คือ ไม่เห็นแก่ตัว เอารัดเอาเปรียบผู้อื่น ไม่อิจฉาริษยาผู้อื่น",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-2",
                name: "แบบฝึกย่อยที่ 17.2.2 คุณธรรม",
                text: "คุณธรรม หมายถึง คุณลักษณะหรือคุณความดีทั้งหลายที่มีอยู่ในคำสอน ซึ่งจะต้องนำมาศึกษาจนเกิดความเข้าใจแล้วนำมาปฏิบัติโดยยึดถือเป็นหลักธรรมประจำใจ นำมาประพฤติปฏิบัติตามสิ่งที่ดีงามเหล่านั้นให้ปรากฏด้วยความสำนึกในความดีเหล่านั้น",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-3",
                name: "แบบฝึกย่อยที่ 17.2.3 สภาพสังคมไทยในปัจจุบัน",
                text: "ถ้าพิจารณาสภาพสังคมไทยในปัจจุบัน จะเห็นว่ามีความสับสนยุ่งยากเดือดร้อน วุ่นวายไม่สงบสุข ขาดความรักสามัคคี การทุจริตคอร์รัปชันมีอยู่แทบทุกวงการ นับเป็นความบกพร่องในคุณธรรมของบุคคลในสังคมที่เป็นฉุดรั้งการพัฒนาประเทศให้ล้าหลัง การขาดคุณธรรม จริยธรรมก่อให้เกิดปัญหาใหญ่ ๆ หลายประการ",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-4",
                name: "แบบฝึกย่อยที่ 17.2.4 เศรษฐกิจพอเพียง",
                text: "เศรษฐกิจพอเพียง เป็นปรัชญาที่พระบาทสมเด็จพระเจ้าอยู่หัวทรงมีพระราชดำรัสชี้แนะแนวทางในการดำเนินชีวิตแก่พสกนิกรชาวไทยมาโดยตลอด ตั้งแต่ก่อนมีวิกฤตการณ์ทางเศรษฐกิจและเมื่อภายหลังได้ทรงเน้นย้ำแนวทางการแก้ไขเพื่อให้รอดพ้น และสามารถดำรงอยู่ได้อย่างมั่นคง และยั่งยืนภายใต้กระแสโลกาภิวัตน์และการเปลี่ยนแปลงต่าง ๆ",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-5",
                name: "แบบฝึกย่อยที่ 17.2.5 ปรัชญาของเศรษฐกิจพอเพียง",
                text: "ปรัชญาของเศรษฐกิจพอเพียงเป็นปรัชญาที่ชี้ถึงแนวทางการดำรงอยู่และปฏิบัติตนของประชาชนในทุกระดับ ตั้งแต่ระดับครอบครัว ระดับชุมชนจนถึงระดับรัฐ ทั้งในการพัฒนาและบริหารประเทศให้ดำเนินไปในทางสายกลาง โดยเฉพาะการพัฒนาเศรษฐกิจเพื่อให้ก้าวทันต่อโลกยุคโลกาภิวัตน์",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-6",
                name: "แบบฝึกย่อยที่ 17.2.6 ความพอเพียงหมายถึง",
                text: "ความพอเพียงหมายถึง ความพอประมาณ ความมีเหตุผล รวมถึงความจำเป็นที่จะต้องมีระบบภูมิคุ้มกันในตัวที่ดีพอสมควรต่อการมีผลกระทบใด ๆ อันเกิดจากการเปลี่ยนแปลงทั้งภายนอกและภายใน ทั้งนี้จะต้องอาศัยความรู้ ความรอบคอบ ความระมัดระวังอย่างยิ่งในการนำวิชาต่าง ๆ มาใช้ในการวางแผนและการดำเนินการทุกขั้นตอน",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-7",
                name: "แบบฝึกย่อยที่ 17.2.7 สถานศึกษาระดับอาชีวศึกษา",
                text: "สถานศึกษาระดับอาชีวศึกษาจะต้องเข้าไปสัมผัสกับชุมชน เพื่อทำให้ชุมชนนั้นรู้สึกว่าต้องพึ่งพาอาศัย เห็นว่าพวกเขามีประโยชน์ เช่น สายไฟในหมู่บ้านที่ชำรุดจะช่วยซ่อมได้อย่างไร ท่อน้ำประปารั่วจะช่วยแก้ไขได้อย่างไร ซึ่งกระบวนต่าง ๆ เหล่านี้จะนำมาซึ่งความรัก ความสามัคคี และจะนำมาซึ่งการสนับสนุนโดยหน่วยงานหรือสถาบันที่มีกำลังพร้อม",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-8",
                name: "แบบฝึกย่อยที่ 17.2.8 สังคมของฝรั่งมีเรื่องจิตอาสาเป็นปกติในชุมชน",
                text: "สังคมของฝรั่งมีเรื่องจิตอาสาเป็นปกติในชุมชน คนที่ครอบครัวมีปัญหาก็สามารถเยียวยาด้วยวิธีจิตอาสา เพราะจะทำให้เห็นว่าโลกนี้ยังมีคนที่ทุกข์ยากกว่าเราอีกมากมาย ฝรั่งมีครูข้างถนนเยอะมาก เพราะคนเราไม่ใช่จะเท่าเทียมกันทั้งหมด ยังมีคนอดมื้อกินมื้ออยู่มาก คนที่ทุกข์ทรมานในโลกนี้มีมหาศาล ลืมตายังไม่รู้เลยว่าจะเอาอะไรกิน",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-9",
                name: "แบบฝึกย่อยที่ 17.2.9 องค์กรมีแต่คนเก่ง",
                text: "การที่องค์กรมีแต่คนเก่งก็ไม่ได้หมายความว่าจะทำให้บริษัทอยู่รอดปลอดภัยไปจนตลอดรอดฝั่ง ถ้าคนเก่งเหล่านั้นใช้ความเก่งในทางที่ผิด เช่น การคอร์รัปชัน การยักยอกทรัพย์สินของบริษัท การหลอกลวงผู้บริโภค การไม่ซื่อสัตย์ต่อลูกค้า การเอาเปรียบคู่ค้าในทางที่ไม่ถูกไม่ควร ฯลฯ ก็สามารถทำให้บริษัทเสียหายได้เช่นกัน",
                timeLimit: 120,
              },
              {
                id: "thai-practice-17-2-10",
                name: "แบบฝึกย่อยที่ 17.2.10 ปรัชญาของเศรษฐกิจพอเพียง",
                text: "ดังนั้น จึงไม่น่าแปลกใจที่วันนี้มีหลายองค์กรได้เห็นความสำคัญในการส่งเสริมบุคลากรให้เป็นคนดีด้วยการรวมพลังกันต่อต้านคอร์รัปชัน ซึ่งเวลาพูดถึงก็มักจะนึกถึงแต่หน่วยงานภาครัฐก่อนเสมอ ซึ่งไม่น่าจะเป็นเช่นนั้น และถ้าจะให้ดีควรขยายผลไปที่ภาคเอกชนให้ร่วมกันส่งเสริมให้คนในองค์กรของตนเองเป็นคนดี มีความซื่อสัตย์สุจริตควบคู่ไปกับการเป็นคนเก่ง ก็น่าจะเป็นประโยชน์ต่อประเทศชาติ",
                timeLimit: 120,
              },
            ],
          },
        ],
      },
    ],
  },
  // {
  //     id: 'english',
  //     name: 'English',
  //     units: [
  //         {
  //             id: 'english-basic',
  //             name: 'Unit 1: Basic',
  //             sessions: [
  //                 {
  //                     id: 'english-basic-session-1',
  //                     name: 'Session 1: Home Row',
  //                     levels: [
  //                         {
  //                             id: 'english-basic-1-1',
  //                             name: 'Level 1: Left Hand',
  //                             text: 'a s d f',
  //                         },
  //                         {
  //                             id: 'english-basic-1-2',
  //                             name: 'Level 2: Right Hand',
  //                             text: 'j k l ;',
  //                         },
  //                         {
  //                             id: 'english-basic-1-3',
  //                             name: 'Level 3: Both Hands',
  //                             text: 'a s d f j k l ;',
  //                         }
  //                     ]
  //                 },
  //                 {
  //                     id: 'english-basic-session-2',
  //                     name: 'Session 2: Top Row',
  //                     levels: [
  //                         {
  //                             id: 'english-basic-2-1',
  //                             name: 'Level 1: Left Side',
  //                             text: 'Q W E R T',
  //                         },
  //                         {
  //                             id: 'english-basic-2-2',
  //                             name: 'Level 2: Right Side',
  //                             text: 'y u i o p',
  //                         },
  //                         {
  //                             id: 'english-basic-2-3',
  //                             name: 'Level 3: Complete Top Row',
  //                             text: 'q w e r t y u i o p',
  //                         }
  //                     ]
  //                 }
  //             ]
  //         },
  //         {
  //             id: 'english-words',
  //             name: 'Unit 2: Words',
  //             sessions: [
  //                 {
  //                     id: 'english-words-session-1',
  //                     name: 'Session 1: Simple Words',
  //                     levels: [
  //                         {
  //                             id: 'english-words-1-1',
  //                             name: 'Level 1: Common Words',
  //                             text: 'the and for are but not you all can had',
  //                         },
  //                         {
  //                             id: 'english-words-1-2',
  //                             name: 'Level 2: More Words',
  //                             text: 'her was one our day get use man new now',
  //                         }
  //                     ]
  //                 }
  //             ]
  //         }
  //     ]
  // }
];

// =============================================================================
// II. เกณฑ์การให้คะแนน (Scoring Criteria)
// =============================================================================

/**
 * @constant scoringCriteria
 * @description
 * ออบเจ็กต์ที่เก็บเกณฑ์การให้คะแนนสำหรับแต่ละด่าน
 * Key: คือ `id` ของด่าน
 * Value: คืออาร์เรย์ของเงื่อนไขการให้เกรด โดยเรียงจากเกรดสูงสุดไปต่ำสุด
 * - minWPM: ความเร็วพิมพ์ขั้นต่ำ (คำต่อนาที) ที่ต้องทำให้ได้
 * - minAccuracy: ความแม่นยำขั้นต่ำ (%) ที่ต้องทำให้ได้
 * - maxErrors: จำนวนข้อผิดพลาดสูงสุดที่ยอมรับได้
 * - grade: เกรดที่จะได้รับหากผ่านเงื่อนไขทั้งหมด
 */
export const scoringCriteria: LevelScoring = {
  // Thai Basic Session 1
  // 'thai-practice-1-1-2': [
  //     { minWPM: 0, maxErrors: 0, score10Point: 10 },
  //     { minWPM: 0, maxErrors: 1, score10Point: 9 },
  //     { minWPM: 0, maxErrors: 2, score10Point: 8 },
  //     { minWPM: 0, maxErrors: 3, score10Point: 7 },
  //     { minWPM: 0, maxErrors: 4, score10Point: 6 },
  //     { minWPM: 0, maxErrors: 5, score10Point: 5 },
  //     { minWPM: 0, maxErrors: 6, score10Point: 4 },
  //     { minWPM: 0, maxErrors: 7, score10Point: 3 },
  //     { minWPM: 0, maxErrors: 8, score10Point: 2 },
  //     { minWPM: 0, maxErrors: 9, score10Point: 1 },
  //     { minWPM: 0, maxErrors: 10, score10Point: 0 },
  // ],
  // 'thai-practice-12-4-2': [
  //     { minWPM: 20, minAccuracy: 95, maxErrors: 2, grade: 'ยอดเยี่ยม!', score10Point: 10 },
  //     { minWPM: 18, minAccuracy: 90, maxErrors: 3, grade: 'ดีมาก', score10Point: 9 },
  //     { minWPM: 16, minAccuracy: 85, maxErrors: 4, grade: 'ดี', score10Point: 8 },
  //     { minWPM: 14, minAccuracy: 80, maxErrors: 5, grade: 'ค่อนข้างดี', score10Point: 7 },
  //     { minWPM: 12, minAccuracy: 75, maxErrors: 6, grade: 'พอใช้', score10Point: 6 },
  //     { minWPM: 10, minAccuracy: 70, maxErrors: 7, grade: 'ปานกลาง', score10Point: 5 },
  //     { minWPM: 8, minAccuracy: 65, maxErrors: 8, grade: 'อ่อน', score10Point: 4 },
  //     { minWPM: 6, minAccuracy: 60, maxErrors: 9, grade: 'ต้องปรับปรุง', score10Point: 3 },
  //     { minWPM: 4, minAccuracy: 55, maxErrors: 10, grade: 'ต้องฝึกเพิ่ม', score10Point: 2 },
  //     { minWPM: 2, minAccuracy: 50, maxErrors: 12, grade: 'เริ่มต้น', score10Point: 1 },
  // ],
};
